lululu-913/F280049_ACAC_Unit1/converter1.c
//#############################################################################
//
//  Dual-module single-phase direct AC-AC Buck-Boost controller (F280049)
//
//  This file is shared by both CCS projects.  Change UNIT_ROLE only:
//      UNIT_1: model 1 = voltage control, model 2 = current sharing
//      UNIT_2: model 2 = voltage control
//
//  IMPORTANT: the delivered build is deliberately gate-locked.  ADC, OLED,
//  keys, PLL, protection and control calculations execute, but the OST latch
//  cannot be cleared while POWER_STAGE_ENABLE is zero.
//
//#############################################################################

#include "F28x_Project.h"
#include "driverlib.h"
#include "math.h"
#include "string.h"
#include "oled.h"

//********** 编译期安全开关 **********//
// 首版只做低压、无功率联调：POWER_STAGE_ENABLE 必须保持 0。
// 需要正式放开功率级时，必须先完成电流标定、栅极波形、CMPSS 和 ISR 实测。
#define UNIT_1                         1
#define UNIT_2                         2
#define PROFILE_HALF                   1
#define PROFILE_FULL                   2
#define HALF_SAFE                      1
#define HALF_IHI                       2
#define AUX_SHARED_FORMAL              1
#define AUX_SHARED_LAB_DEBUG           2

#define UNIT_ROLE UNIT_1
#define POWER_STAGE_ENABLE          1U
#define POWER_PROFILE               PROFILE_HALF
#define HALF_CURRENT_STAGE          HALF_SAFE
#define HALF_IHI_TEST_PASSED_ACK       0
#define FORMAL_HW_RELEASE_ACK           0
#define DIRECTION_DIAG_8V              0
#define AUX_TOPOLOGY                   AUX_SHARED_LAB_DEBUG
#define CURRENT_LOOP_INTEGRAL_ENABLE   1U
#define GATE_OPEN_LOOP_TEST           0U
#define OPEN_LOOP_DUTY                0.10f

// CMPSS7 digital deglitch filter. At 100 MHz SYSCLK this samples every
// 100 ns and requires 3 of 5 over-limit samples, rejecting narrow bipolar
// switching spikes while keeping the hardware trip response below 1 us.
#define IL_CMPSS_FILTER_PRESCALE        9U
#define IL_CMPSS_FILTER_WINDOW          5U
#define IL_CMPSS_FILTER_THRESHOLD       3U

#if UNIT_ROLE != UNIT_1 && UNIT_ROLE != UNIT_2
#error invalid UNIT_ROLE
#endif
#if POWER_STAGE_ENABLE != 0 && POWER_STAGE_ENABLE != 1
#error invalid POWER_STAGE_ENABLE
#endif
#if POWER_PROFILE != PROFILE_HALF && POWER_PROFILE != PROFILE_FULL
#error invalid POWER_PROFILE
#endif
#if HALF_CURRENT_STAGE != HALF_SAFE && HALF_CURRENT_STAGE != HALF_IHI
#error invalid HALF_CURRENT_STAGE
#endif
#if AUX_TOPOLOGY != AUX_SHARED_FORMAL && AUX_TOPOLOGY != AUX_SHARED_LAB_DEBUG
#error invalid AUX_TOPOLOGY
#endif
#if HALF_IHI_TEST_PASSED_ACK != 0 && HALF_IHI_TEST_PASSED_ACK != 1
#error invalid HALF_IHI_TEST_PASSED_ACK
#endif
#if FORMAL_HW_RELEASE_ACK != 0 && FORMAL_HW_RELEASE_ACK != 1
#error invalid FORMAL_HW_RELEASE_ACK
#endif
#if DIRECTION_DIAG_8V != 0 && DIRECTION_DIAG_8V != 1
#error invalid DIRECTION_DIAG_8V
#endif
#if CURRENT_LOOP_INTEGRAL_ENABLE != 0 && CURRENT_LOOP_INTEGRAL_ENABLE != 1
#error invalid CURRENT_LOOP_INTEGRAL_ENABLE
#endif
#if DIRECTION_DIAG_8V && \
   (POWER_PROFILE != PROFILE_HALF || HALF_CURRENT_STAGE != HALF_SAFE || \
    AUX_TOPOLOGY != AUX_SHARED_LAB_DEBUG || HALF_IHI_TEST_PASSED_ACK != 0)
#error 8V direction diagnostic requires HALF SAFE and lab auxiliary
#endif
#if GATE_OPEN_LOOP_TEST && \
   ((POWER_STAGE_ENABLE != 1U) || \
    (DIRECTION_DIAG_8V != 1U) || \
    (POWER_PROFILE != PROFILE_HALF) || \
    (HALF_CURRENT_STAGE != HALF_SAFE) || \
    (AUX_TOPOLOGY != AUX_SHARED_LAB_DEBUG))
#error Open-loop gate test requires isolated 8V HALF_SAFE configuration
#endif
#if POWER_PROFILE == PROFILE_FULL && AUX_TOPOLOGY != AUX_SHARED_FORMAL
#error FULL profile requires approved transformer-fed auxiliary supply
#endif
#if POWER_PROFILE == PROFILE_FULL && FORMAL_HW_RELEASE_ACK != 1
#error FULL profile requires explicit formal hardware release
#endif
#if POWER_PROFILE == PROFILE_FULL && HALF_IHI_TEST_PASSED_ACK != 1
#error FULL profile requires completed HALF rated-current tests
#endif

//********** 固定硬件参数 **********//
// 20 kHz 载波、1 mH 电感、Ci=11 uF、Co=21 uF。所有电流限值都必须按实测
// 传感器标定值重新确认；这里的宏只是当前工程的初始保护值。
#define PI_F                            3.14159265358979323846f
#define TWO_PI_F                       (2.0f * PI_F)
#define SQRT2_F                         1.4142135623730950488f
#define INV_SQRT2_F                     0.7071067811865475244f
#define CONTROL_HZ                      20000.0f
#define CONTROL_TS                     0.00005f
#define PWM_TBPRD                       2500U
#define PWM_DEAD_TICKS                  25U
#define PWM_ZC_TICKS                    25U
#define PWM_D_MIN                       0.02f
#define PWM_D_MAX                       0.85f
#define RMS_WINDOW                      400U
#define L_HENRY                         0.001f
#define CO_FARAD                        21.0e-6f
#define IO_FF_A                         0.881911f
#define FUND_LPF_A                      0.993737f
#define IL_TO_OUTPUT_SIGN              (-1.0f)

//********** ADC 标定参数 (physical = (raw - offset) / gain) **********//
#define UI_ADC_OFFSET                    2066.2f
#define UI_ADC_GAIN                      36.443f
#define UO_ADC_OFFSET                    2067.0f
#define UO_ADC_GAIN                      36.378f
#define IL_ADC_OFFSET                    2091.9f
#define IL_ADC_GAIN                      334.04f
#define IO_ADC_OFFSET                    2097.6f
#define IO_ADC_GAIN                      333.10f
#define IT_ADC_OFFSET                    2094.0f
#define IT_ADC_GAIN                      330.25f
// 极性(Polarity)：#1，取决于差分前端接线方向
#define UI_ADC_POLARITY                  1.0f
#define UO_ADC_POLARITY                  1.0f
#define IL_ADC_POLARITY                  1.0f
#define IO_ADC_POLARITY                  1.0f
#define IT_ADC_POLARITY                  1.0f

//********** 电压范围与保护阈值 (V) **********//
#if POWER_PROFILE == PROFILE_HALF
// 12 V RMS输入低功率测试
#define UI_START_MIN                     10.5f
#define UI_START_MAX                     13.5f
#define UI_RUN_MIN                       10.0f
#define UI_RUN_MAX                       14.0f

// 第一次测试先限制为低输出电压
#define UO_SINGLE_MAX                    10.0f
#define UO_PARALLEL_MAX                  8.0f
#define UO_DEFAULT                       5.0f
#define UO_RMS_HARD_MAX                  11.0f
#define UO_ABS_PK_TRIP                   16.0f
#define UOV_MARGIN                       1.0f
#else
// 输入电压启动/运行窗口
#define UI_START_MIN                     33.0f
#define UI_START_MAX                     38.0f
#define UI_RUN_MIN                       30.0f
#define UI_RUN_MAX                       38.0f
#define UO_SINGLE_MAX                    35.0f
#define UO_PARALLEL_MAX                  30.0f
#define UO_DEFAULT                       30.0f
#define UO_RMS_HARD_MAX                  37.0f
#define UO_ABS_PK_TRIP                   53.0f
#define UOV_MARGIN                       2.0f
#endif

//********** 电流保护阈值 (A) **********//
#if POWER_PROFILE == PROFILE_FULL || HALF_CURRENT_STAGE == HALF_IHI
#define I_BRANCH_CMD_MAX                 2.05f
#define IO_PK_TRIP                       3.50f
#define IO_RMS_TRIP                      2.25f
#define IT_PK_TRIP                       7.00f
#define IT_RMS_TRIP                      4.50f
#define IL_REF_PK_MAX                    5.80f
#define IL_SW_FAST_LIMIT                 6.00f
#define IL_CMPSS_TRIP                    6.50f
#define IL_RMS_CONT                      4.00f
#define IL_RMS_TRIP                      4.20f
#else
#define I_BRANCH_CMD_MAX                 1.15f
#define IO_PK_TRIP                       2.00f
#define IO_RMS_TRIP                      1.30f
#define IT_PK_TRIP                       4.00f
#define IT_RMS_TRIP                      2.50f
#define IL_REF_PK_MAX                    3.10f
#define IL_SW_FAST_LIMIT                 3.40f
#define IL_CMPSS_TRIP                    3.80f
#define IL_RMS_CONT                      2.20f
#define IL_RMS_TRIP                      2.40f
#endif

