lululu-913/F280049_ACAC_Unit1/converter1.c
#if DIRECTION_DIAG_8V
#undef UI_START_MIN
#undef UI_START_MAX
#undef UI_RUN_MIN
#undef UI_RUN_MAX
#undef UO_DEFAULT
#undef IL_REF_PK_MAX
#undef IL_SW_FAST_LIMIT
#undef IL_CMPSS_TRIP
// 输入电压启动/运行窗口
#define UI_START_MIN                     4.0f
#define UI_START_MAX                     8.0f
#define UI_RUN_MIN                       4.0f
#define UI_RUN_MAX                       8.0f
#define UO_DEFAULT                       1.0f
#define IL_REF_PK_MAX                    0.45f
#define IL_SW_FAST_LIMIT                 0.60f
#define IL_CMPSS_TRIP                    0.80f
#endif

//********** 过零迟滞换向 **********//
#define ZC_ALPHA_HYST_V                 0.10f
#define ZC_BLOCK_SAMPLES                160U

//********** PLL 和控制增益（调试初值）**********//
#define PLL_KP                           88.9f
#define PLL_KI                           3948.0f
#define PLL_W_MIN                        (TWO_PI_F * 45.0f)
#define PLL_W_MAX                        (TWO_PI_F * 55.0f)
#define PLL_SOGI_K                       1.41421356237f
#define CURRENT_KP                       2.0f
#define CURRENT_KI                       80.0f
#define VOLTAGE_KP                       1.0e-3f
#define VOLTAGE_KI                       5.0e-2f
#define SHARE_KP                         0.25f
#define SHARE_KI                         78.5f

#define KEY1_IN                         (GpioDataRegs.GPADAT.bit.GPIO27 == 0U)
#define KEY2_IN                         (GpioDataRegs.GPADAT.bit.GPIO25 == 0U)
#define KEY3_IN                         (GpioDataRegs.GPADAT.bit.GPIO17 == 0U)
#define KEY4_IN                         (GpioDataRegs.GPADAT.bit.GPIO26 == 0U)
#define KEY5_IN                         (GpioDataRegs.GPADAT.bit.GPIO16 == 0U)
#define KEY6_IN                         (GpioDataRegs.GPBDAT.bit.GPIO39 == 0U)

typedef enum
{
    MODEL_SAFE = 0,
    MODEL_VOLTAGE = 1,
    MODEL_PARALLEL = 2
} ModelCode;

typedef enum
{
    ST_BOOT = 0, ST_SAFE, ST_PRECHECK, ST_INPUT_PLL, ST_WAIT_UO,
    ST_OUTPUT_PLL, ST_SS5_RAMP, ST_SS5_HOLD, ST_SHARE_RAMP,
    ST_VOLT_RAMP, ST_RUN, ST_STOP_RAMP, ST_WAIT_MASTER_OFF,
    ST_DISCHARGE, ST_GATE_TEST, ST_FAULT
} RunState;

typedef enum
{
    GATE_BLOCKED = 0, GATE_ZC_A, GATE_ZC_B, GATE_ACTIVE
} GateState;

typedef enum
{
    HALF_POS = 1, HALF_NEG = -1
} HalfPolarity;

typedef enum
{
    FAULT_OK = 0, FAULT_IL_PK = 1, FAULT_IL_RMS = 2,
    FAULT_IO = 3, FAULT_IT = 4, FAULT_UO_OV = 5,
    FAULT_UI = 6, FAULT_BUS_LOST = 7, FAULT_PLL = 8,
    FAULT_ADC = 9, FAULT_START = 10, FAULT_DC_OFFSET = 11,
    FAULT_MODE = 12, FAULT_PHASE = 13, FAULT_DISCHARGE = 14,
    FAULT_CPU = 15, FAULT_TEMP = 16
} FaultCode;

typedef struct
{
    float alpha;
    float beta;
    float v_prev;
    float dalpha;
} SogiState;

typedef struct
{
    SogiState sogi;
    float theta;
    float omega;
    float integrator;
    float amplitude;
    float amplitude_published;
    float q_norm;
    Uint16 locked;
    Uint32 lock_samples;
    float sin_theta;
    float cos_theta;
    float sin_dtheta;
    float cos_dtheta;
} SinglePhasePll;

typedef struct
{
    float kp;
    float ki;
    float integral;
    float out_min;
    float out_max;
} PiController;

typedef struct
{
    float data[RMS_WINDOW];
    float sum_sq;
    float sum;
    Uint16 index;
    Uint16 filled;
    float rms;
    float mean;
} SlidingRms;

typedef struct
{
    Uint16 raw_ui;
    Uint16 raw_uo;
    Uint16 raw_il;
    Uint16 raw_io;
    Uint16 raw_it;
    float ui;
    float uo;
    float il;
    float io;
    float it;
    float ui_rms;
    float uo_rms;
    float il_rms;
    float io_rms;
    float it_rms;
    float il_mean;
    float uo_mean;
} Measurements;

typedef struct
{
    Uint16 stable;
    Uint16 count;
    Uint16 held_ms;
    Uint16 repeat_ms;
    Uint16 long_fired;
    Uint16 press_edge;
    Uint16 release_edge;
    Uint16 repeat_edge;
} KeyState;

typedef struct
{
    float d;
    float q;
} DqLowPass;

//********** 运行状态 **********//
// ADC/PLL/RMS/PI 状态在 ISR 中更新；按键、OLED 和状态机在主循环中低速运行。
volatile Measurements meas;
SinglePhasePll pll_ui;
SinglePhasePll pll_uo;
SogiState uo_observer;
SlidingRms rms_il;
SlidingRms rms_io;
SlidingRms rms_it;
SlidingRms rms_uo;
PiController pi_id;
PiController pi_vd;
PiController pi_vq;
PiController pi_sd;
PiController pi_sq;
DqLowPass it_dq;
DqLowPass io_dq;

volatile RunState run_state = ST_BOOT;
volatile GateState gate_state = GATE_BLOCKED;
volatile HalfPolarity half = HALF_POS;
volatile HalfPolarity next_half = HALF_POS;
volatile FaultCode fault_code = FAULT_OK;
volatile FaultCode warning_code = FAULT_OK;
volatile Measurements fault_snapshot;
volatile RunState fault_state = ST_BOOT;
volatile float fault_duty = PWM_D_MIN;
volatile Uint16 model_cmd = MODEL_SAFE;
volatile Uint16 model_active = MODEL_SAFE;
volatile Uint16 start_request = 0U;
volatile Uint16 stop_request = 0U;
volatile Uint16 clear_request = 0U;
volatile Uint16 tick_1ms = 0U;
volatile Uint16 tick_5ms = 0U;
volatile Uint16 tick_100ms = 0U;
volatile Uint16 tick_div_5ms = 0U;
volatile Uint16 tick_div_100ms = 0U;
volatile Uint32 isr_heartbeat = 0UL;
volatile Uint32 main_heartbeat = 0UL;
volatile Uint32 state_ms = 0UL;
volatile Uint32 isr_overrun_count = 0UL;
// 调试观测量：用于区分 WDT 复位、ADCINT 溢出和 ISR 实际超时。
volatile Uint32 debug_reset_cause = 0UL;
volatile Uint16 debug_last_isr_ticks = 0U;
volatile Uint16 debug_max_isr_ticks = 0U;
volatile Uint16 debug_adc_ovf_count = 0U;

float u_ref_cmd = UO_DEFAULT;
float u_ref_active = 0.0f;
float trim_low = 0.0f;
float trim_high = 0.0f;
float k_cmd = 1.0f;
float k_active = 1.0f;
float share_alpha_ramp = 0.0f;
float io_ff = 0.0f;
float duty = PWM_D_MIN;
float il_ref = 0.0f;
float il_ref_prev = 0.0f;
float it_fund_rms = 0.0f;
float io_fund_rms = 0.0f;
float share_error_pct = 0.0f;
float iconv_ref_held = 0.0f;
float iconv_ref_target = 0.0f;
float dff_held = PWM_D_MIN;
float dff_target = PWM_D_MIN;
float uo_amp_held = 0.0f;
Uint16 k_limited = 0U;
Uint16 bus_valid = 0U;
Uint16 gate_start_pending = 0U;
Uint16 adc_bad_count = 0U;
Uint16 il_fast_count = 0U;
Uint16 io_pk_count = 0U;
Uint16 it_pk_count = 0U;
Uint16 uo_pk_count = 0U;
volatile float debug_dynamic_ov = 0.0f;
volatile float debug_u_ref_active = 0.0f;
Uint16 il_rms_count = 0U;
Uint16 io_rms_count = 0U;
Uint16 it_rms_count = 0U;
Uint16 ui_bad_count = 0U;
Uint16 pll_bad_count = 0U;
Uint16 bus_lost_count = 0U;
Uint16 dc_bad_count = 0U;
Uint16 zc_stage_periods = 0U;
Uint16 sample_div = 0U;
Uint16 oled_line = 0U;
Uint16 ss5_stable_ms = 0U;
Uint16 voltage_stable_ms = 0U;
Uint16 voltage_error_ms = 0U;
Uint16 current_limit_ms = 0U;
Uint16 current_release_ms = 0U;
Uint16 current_limit_active = 0U;
Uint16 fault_clear_safe_ms = 0U;
Uint16 trip_clear_safe_count = 0U;
Uint16 open_loop_test_ms = 0U;
float ui_alpha_prev = 0.0f;
volatile Uint32 debug_half_change_count = 0UL;
int16 zc_alpha_region = 0;
Uint16 half_change_block_count = 0U;
volatile Uint32 debug_rejected_zc_count = 0UL;
volatile float debug_uo_d = 0.0f;
volatile float debug_uo_q = 0.0f;
volatile float debug_vd_error = 0.0f;
volatile float debug_vq_error = 0.0f;
volatile Uint32 debug_zc_a_count = 0UL;
volatile Uint32 debug_zc_b_count = 0UL;
volatile Uint32 debug_zc_done_count = 0UL;
volatile Uint16 debug_il_fault_source = 0U;
volatile Uint16 debug_cmpss_status_at_fault = 0U;
volatile Uint16 debug_epwm1_tz_at_fault = 0U;
volatile Uint16 debug_epwm2_tz_at_fault = 0U;
KeyState keys_state[6];

// 函数持久状态（原 static 局部变量，统一风格提升至文件域）
Uint16 dead_bus_count = 0U;
Uint16 adc_isr_overrun_consecutive = 0U;
Uint32 main_isr_seen = 0UL;
Uint32 main_main_seen = 0UL;

#ifdef _FLASH
extern Uint16 RamfuncsLoadStart;
extern Uint16 RamfuncsRunStart;
extern Uint16 RamfuncsLoadSize;
#endif

//********** 函数声明 **********//
__interrupt void adcB1ISR(void);
void hardware_init(void);
void gpio_init_local(void);
void gpio_enable_pwm_mux(void);
void keys_init(void);
void adc_init_local(void);
void adc_soc_init(void);
void pwm_init_local(void);
void pwm_module_init(volatile struct EPWM_REGS *pwm, Uint16 master);
void cmpss_trip_init(void);
void controllers_init(void);
void pwm_force_off(void);
Uint16 trip_clear_qualify_fast(void);
Uint16 pwm_clear_ost(void);
void pwm_set_normal(HalfPolarity half, float duty);
void pwm_set_zc_a(HalfPolarity next_half);
void pwm_set_zc_b(HalfPolarity next_half);
void pwm_set_aq_active(volatile struct EPWM_REGS *pwm);
void pwm_set_aq_delayed_high(volatile struct EPWM_REGS *pwm, Uint16 output_a,
                                    Uint16 ticks);
void pwm_force_pair(volatile struct EPWM_REGS *pwm, Uint16 a_force,
                           Uint16 b_force);
void gate_sequence_update(void);
void request_half_change(HalfPolarity next_half);
void sample_and_calibrate(void);
void signal_processing_fast(void);
void signal_processing_slow(void);
void software_protection_fast(void);
void software_protection_slow(void);
void control_update_fast(void);
void control_update_slow(void);
void slow_state_machine_1ms(void);
Uint16 voltage_current_limit_1ms(void);
void keys_update_5ms(void);
void key_action(Uint16 key, Uint16 repeat_event, Uint16 release_event,
                       Uint16 long_event);
void oled_update_one_line(void);
void latch_fault(FaultCode fault);
Uint16 fault_clear_conditions(void);
Uint16 is_voltage_role(void);
Uint16 is_share_role(void);
Uint16 model_is_legal(Uint16 model);
Uint16 dead_bus(void);
Uint16 input_start_ok(void);
Uint16 input_run_ok(void);
Uint16 predicted_zero(void);
float effective_u_ref(void);
float active_u_max(void);
float clampf_local(float x, float lo, float hi);
float slew(float x, float target, float step);
float wrap_pi(float x);
void sogi_update(SogiState *s, float input, float omega);
void pll_update_fast(SinglePhasePll *pll, float input, float amp_min);
void pll_slow_update(SinglePhasePll *pll, float amp_min);
void rms_update_fast(SlidingRms *r, float x);
void rms_slow_update(SlidingRms *r);
void mean_update_fast(SlidingRms *r, float x);
void mean_slow_update(SlidingRms *r);
float pi_update(PiController *pi, float error, Uint16 integrate);
float pi_update_dt(PiController *pi, float error, Uint16 integrate, float dt);
void pi_reset(PiController *pi);
void dq_lpf_update(DqLowPass *f, float x, float sn, float cs);
void clear_line(char *line);
void put_text(char *line, Uint16 pos, const char *s);
void put_u2(char *line, Uint16 pos, Uint16 v);
void put_fixed(char *line, Uint16 pos, float x, Uint16 decimals,
                      Uint16 width);
const char *state_text(RunState state);
const char *profile_text(void);

