lululu-913/F280049_ACAC_Unit1/converter1.c
//********** 主循环 **********//
// 主循环不直接产生 PWM，只处理模式、按键、OLED、看门狗和故障复位。
void main(void)
    {
    Uint32 reset_cause;

#ifdef _FLASH
    // 将时间关键代码从 Flash 复制到 RAM（零等待执行）
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize);
#endif

    // 初始化顺序很重要：先建立系统时钟，再把门极保持为 GPIO 低电平，
    // 然后初始化 ADC/ePWM/CMPSS，最后才开放中断和低速任务。
    InitSysCtrl();        // 系统时钟初始化（PLL、外设时钟、看门狗）
    reset_cause = SysCtl_getResetCause();
    debug_reset_cause = reset_cause;
    hardware_init();    // 外设初始化（GPIO/ADC/PWM/CMPSS/OLED）
    controllers_init();  // 控制器/PLL/RMS 状态清零

    run_state = ST_SAFE;       // 初始化完成，进入安全待机
    pwm_force_off();           // 确保所有门极驱动信号为低
    if ((reset_cause & (SYSCTL_CAUSE_WDRS | SYSCTL_CAUSE_NMIWDRS)) != 0UL)
    {
        latch_fault(FAULT_CPU);
    }
    SysCtl_clearResetCause(reset_cause);

    EALLOW;
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 1U;
    EDIS;

    IER |= M_INT1;
    PieCtrlRegs.PIEIER1.bit.INTx1 = 0U;  // ADCA1 关闭
    PieCtrlRegs.PIEIER1.bit.INTx2 = 1U;  // ADCB1 开启
    EINT;
    ERTM;

    SysCtl_setWatchdogMode(SYSCTL_WD_MODE_RESET);
    // Reset defaults give only about 13 ms.  A 16-character software-I2C
    // OLED line can take tens of milliseconds, so retain fault detection while
    // allowing the documented low-speed task to complete.
    SysCtl_setWatchdogPredivider(SYSCTL_WD_PREDIV_512);
    SysCtl_setWatchdogPrescaler(SYSCTL_WD_PRESCALE_64);
    SysCtl_serviceWatchdog();
    SysCtl_enableWatchdog();

    // 1 ms 状态机、5 ms 按键、100 ms OLED 都由 ISR 产生的计数节拍驱动。
    // 使用计数而不是单比特标志，避免 OLED 阻塞时丢失低速节拍。
    for (;;)
    {
        Uint16 do_1ms = 0U;
        Uint16 do_5ms = 0U;
        Uint16 do_100ms = 0U;
        Uint32 isr_now;
        Uint32 isr_seen = main_isr_seen;
        Uint32 main_seen = main_main_seen;

        main_heartbeat++;           // 主循环心跳（WDT 服务判断用）
        DINT;                      // 关中断，原子读取 ISR 定时标志
        if (tick_1ms != 0U) { tick_1ms--; do_1ms = 1U; }
        if (tick_5ms != 0U) { tick_5ms--; do_5ms = 1U; }
        if (tick_100ms != 0U) { tick_100ms--; do_100ms = 1U; }
        isr_now = isr_heartbeat;
        EINT;                      // 恢复中断

        // ---- 1 ms 任务：状态机、限流、启动/停止时序 ----
        if (do_1ms != 0U)
        {
            slow_state_machine_1ms();
            if ((isr_now != isr_seen) && (main_heartbeat != main_seen))
            {
                isr_seen = isr_now;
                main_seen = main_heartbeat;
                main_isr_seen = isr_seen;
                main_main_seen = main_seen;
                SysCtl_serviceWatchdog();
            }
        }
        // ---- 5 ms 任务：按键扫描 ----
        if (do_5ms != 0U)
        {
            keys_update_5ms();
        }
        // ---- 100 ms 任务：OLED 显示刷新（4 行轮显）----
        if (do_100ms != 0U)
        {
            oled_update_one_line();
        }
    }
}

//********** OLED 显示 **********//
// OLED 精简版：单字母标签，保留标志性区分。
void oled_update_one_line(void)
{
    char line[17];
    Uint16 model = (model_active != MODEL_SAFE) ? model_active : model_cmd;

    clear_line(line);
    if (oled_line == 0U)
    {
        put_text(line, 0U, profile_text());
#if UNIT_ROLE == UNIT_1
        put_text(line, 6U, (model == MODEL_PARALLEL) ? "M2SH" :
                            ((model == MODEL_VOLTAGE) ? "M1VC" : "M0--"));
#else
        put_text(line, 6U, (model == MODEL_PARALLEL) ? "M2VC" : "M0--");
#endif
        put_text(line, 11U, state_text(run_state));
    }
    else if (oled_line == 1U)
    {
        if (run_state == ST_FAULT)
        {
            put_text(line, 0U, "F");
            put_u2(line, 2U, (Uint16)fault_code);
            put_text(line, 5U, "OST");
        }
        else
        {
            put_text(line, 0U, "U");
            put_fixed(line, 1U, (run_state == ST_FAULT) ?
                      fault_snapshot.uo_rms : meas.uo_rms, 1U, 5U);
            put_text(line, 7U, "r");
            put_fixed(line, 8U, effective_u_ref(), 1U, 5U);
        }
    }
    else if (oled_line == 2U)
    {
        put_text(line, 0U, "L");
        put_fixed(line, 1U, (run_state == ST_FAULT) ?
                  fault_snapshot.il_rms : meas.il_rms, 2U, 5U);
        put_text(line, 7U, "o");
        put_fixed(line, 8U, (run_state == ST_FAULT) ?
                  fault_snapshot.io_rms : meas.io_rms, 2U, 5U);
    }
    else
    {
        put_text(line, 0U, "P");
        put_text(line, 1U, pll_ui.locked ? "Y" : "N");
        put_text(line, 4U, "Hz");
        put_fixed(line, 6U, pll_ui.omega / TWO_PI_F, 1U, 5U);
        put_text(line, 12U, "w");
        put_u2(line, 13U, (Uint16)((fault_code != FAULT_OK) ? fault_code : warning_code));
    }

    OLED_ShowString(0U, (Uchar)oled_line, line);
    oled_line = (oled_line + 1U) & 3U;
}

//********** 安全条件 **********//
// 这里的条件只负责“允许启动/允许清故障”，最终硬件过流仍由 CMPSS→ePWM OST
// 异步链路完成，不能用软件轮询替代。
void latch_fault(FaultCode fault)
{
    // 只记录第一个故障，保存当时的采样值、状态和占空比，避免后续故障覆盖根因。
    if ((fault != FAULT_OK) && (fault_code == FAULT_OK))
    {
        // Freeze the first fault context before changing the state or outputs.
        // Subsequent protection sources must not overwrite the root event.
        fault_snapshot = meas;
        fault_state = run_state;
        fault_duty = duty;
        fault_clear_safe_ms = 0U;
        fault_code = fault;
        run_state = ST_FAULT;
        model_cmd = MODEL_SAFE;
        start_request = 0U;
        stop_request = 0U;
        pwm_force_off();           // 确保所有门极驱动信号为低
    }
}

Uint16 fault_clear_conditions(void)
{
    // 故障清除必须同时满足：ADC 原始码有效、母线已放电、CMPSS 未动作、
    // 电流低于恢复阈值，并连续保持 100 ms；否则继续保持 OST。
    Uint16 raw_ok = ((meas.raw_ui >= 64U) && (meas.raw_ui <= 4031U) &&
                     (meas.raw_uo >= 64U) && (meas.raw_uo <= 4031U) &&
                     (meas.raw_il >= 64U) && (meas.raw_il <= 4031U) &&
                     (meas.raw_io >= 64U) && (meas.raw_io <= 4031U));
#if UNIT_ROLE == UNIT_1
    raw_ok = raw_ok && (meas.raw_it >= 64U) && (meas.raw_it <= 4031U);
#endif
    Uint16 comparator_active = CMPSS_getStatus(CMPSS7_BASE) &
                               (CMPSS_STS_HI_FILTOUT | CMPSS_STS_LO_FILTOUT);
    if (!raw_ok || !dead_bus() || (comparator_active != 0U) ||
        (fabsf(meas.il) > 0.8f * IL_CMPSS_TRIP))
    {
        fault_clear_safe_ms = 0U;
        return 0U;
    }
    if ((fault_code == FAULT_IL_RMS) && (meas.il_rms > 0.8f * IL_RMS_TRIP))
    {
        fault_clear_safe_ms = 0U; return 0U;
    }
    if ((fault_code == FAULT_IO) && (meas.io_rms > 0.8f * IO_RMS_TRIP))
    {
        fault_clear_safe_ms = 0U; return 0U;
    }
#if UNIT_ROLE == UNIT_1
    if ((fault_code == FAULT_IT) && (meas.it_rms > 0.8f * IT_RMS_TRIP))
    {
        fault_clear_safe_ms = 0U; return 0U;
    }
#endif
    if (fault_clear_safe_ms < 100U) fault_clear_safe_ms++;
    return (fault_clear_safe_ms >= 100U) ? 1U : 0U;
}

Uint16 is_voltage_role(void)
{
#if UNIT_ROLE == UNIT_1
    return (model_active == MODEL_VOLTAGE) ? 1U : 0U;
#else
    return (model_active == MODEL_PARALLEL) ? 1U : 0U;
#endif
}

