lululu-913/F280049_ACAC_Unit1/converter1.c
Uint16 is_share_role(void)
{
#if UNIT_ROLE == UNIT_1
    return (model_active == MODEL_PARALLEL) ? 1U : 0U;
#else
    return 0U;
#endif
}

Uint16 model_is_legal(Uint16 model)
{
#if UNIT_ROLE == UNIT_1
    return ((model == MODEL_SAFE) || (model == MODEL_VOLTAGE) ||
            (model == MODEL_PARALLEL)) ? 1U : 0U;
#else
    return ((model == MODEL_SAFE) || (model == MODEL_PARALLEL)) ? 1U : 0U;
#endif
}

Uint16 dead_bus(void)
{
    // 用 Uo、iL、Io 的 RMS 同时接近零判断母线已安全放电，连续 100 ms 才有效。
    Uint16 count = dead_bus_count;
    Uint16 now = ((meas.uo_rms < 2.0f) && (meas.il_rms < 0.10f) &&
                  (meas.io_rms < 0.10f));
    if (now)
    {
        if (count < 100U) count++;
    }
    else count = 0U;
    dead_bus_count = count;
    return (count >= 100U) ? 1U : 0U;
    return (count >= 100U) ? 1U : 0U;
}

Uint16 input_start_ok(void)
{
    // 启动前只接受半压档输入范围和 48~52 Hz 的输入频率，防止异常输入直接开闸。
    return ((meas.ui_rms >= UI_START_MIN) &&
            (meas.ui_rms <= UI_START_MAX) &&
            (pll_ui.omega >= TWO_PI_F * 48.0f) &&
            (pll_ui.omega <= TWO_PI_F * 52.0f)) ? 1U : 0U;
}

Uint16 input_run_ok(void)
{
    return ((meas.ui_rms >= UI_RUN_MIN) &&
            (meas.ui_rms <= UI_RUN_MAX)) ? 1U : 0U;
}

Uint16 predicted_zero(void)
{
    // SOGI alpha 接近零且 PLL 相位接近 0 或 π 时认为到达过零点；并联时还要
    // 检查输出 PLL 同时过零，避免在活母线非同步位置接入。
    float phase = wrap_pi(pll_ui.theta);
    float pa = fabsf(phase);
    float pb = fabsf(pa - PI_F);
    float distance = (pa < pb) ? pa : pb;
    Uint16 ui_zero = ((fabsf(pll_ui.sogi.alpha) < 1.5f) &&
                      (distance < 2.0f * PI_F / 180.0f)) ? 1U : 0U;
    if (ui_zero == 0U) return 0U;
#if UNIT_ROLE == UNIT_1
    if (is_share_role() != 0U)
    {
        float out_phase = wrap_pi(pll_uo.theta);
        float oa = fabsf(out_phase);
        float ob = fabsf(oa - PI_F);
        float out_distance = (oa < ob) ? oa : ob;
        return ((fabsf(pll_uo.sogi.alpha) < 1.5f) &&
                (out_distance < 2.0f * PI_F / 180.0f) &&
                (pll_uo.locked != 0U)) ? 1U : 0U;
    }
#endif
    return ui_zero;
}

float effective_u_ref(void)
{
    // 将按键设定值叠加低端/高端 ±25 mV 微调；普通电压档保持 0.5 V 步进。
    if (DIRECTION_DIAG_8V) return 1.0f;
#if UNIT_ROLE == UNIT_1
    if (model_cmd == MODEL_VOLTAGE || model_active == MODEL_VOLTAGE)
    {
        if (fabsf(u_ref_cmd - 1.0f) < 0.001f)
            return u_ref_cmd + trim_low;
        if (fabsf(u_ref_cmd - UO_SINGLE_MAX) < 0.001f)
            return u_ref_cmd + trim_high;
    }
#endif
    return u_ref_cmd;
}

float active_u_max(void)
{
#if UNIT_ROLE == UNIT_1
    if ((model_cmd == MODEL_VOLTAGE) || (model_active == MODEL_VOLTAGE))
        return UO_SINGLE_MAX;
#endif
    return UO_PARALLEL_MAX;
}

//********** 数学工具函数 **********//
float clampf_local(float x, float lo, float hi)
{
    // 通用限幅：保护参考、占空比、PI 输出和校准阈值不越过安全边界。
    if (x < lo) return lo;
    if (x > hi) return hi;
    return x;
}

float slew(float x, float target, float step)
{
    // 每次只允许有限步长，限制软启动、停机和并联系数变化率。
    if (x < target - step) return x + step;
    if (x > target + step) return x - step;
    return target;
}

float wrap_pi(float x)
{
    // 将相位折返到 [-π, π]，用于比较输入/输出 PLL 的相对相位。
    while (x > PI_F) x -= TWO_PI_F;
    while (x < -PI_F) x += TWO_PI_F;
    return x;
}

void sogi_update(SogiState *s, float input, float omega)
{
    // 二阶广义积分器产生 alpha/beta 正交量；dalpha 是后续电容电流前馈所需的
    // 电压导数近似。omega 由对应 PLL 提供，频率变化时滤波中心同步变化。
    // Implicit trapezoidal (Tustin) update of
    // x1'=-k*w*x1-w*x2+k*w*v, x2'=w*x1.
    float a = 0.5f * CONTROL_TS;
    float c = a * PLL_SOGI_K * omega + a * a * omega * omega;
    float x1_old = s->alpha;
    float x2_old = s->beta;
    float x1_new = ((1.0f - c) * x1_old - 2.0f * a * omega * x2_old +
                    a * PLL_SOGI_K * omega * (s->v_prev + input)) /
                   (1.0f + c);
    float x2_new = x2_old + a * omega * (x1_old + x1_new);
    s->dalpha = -PLL_SOGI_K * omega * x1_new - omega * x2_new +
                PLL_SOGI_K * omega * input;
    s->alpha = x1_new;
    s->beta = x2_new;
    s->v_prev = input;
}

void pll_update_fast(SinglePhasePll *pll, float input, float amp_min)
{
    // 20 kHz 快速路径：SOGI 更新、相位误差、频率积分、正交递推。
    // 不调用 sinf/cosf/sqrtf；sin/cos 状态由正交递推推进，每步仅 4 次乘加。
    // 幅值使用 1 kHz 发布的 amplitude_published 带下限归一化。
    float sn = pll->sin_theta;
    float cs = pll->cos_theta;
    float error;
    float sn_new;
    float cs_new;

    sogi_update(&pll->sogi, input, pll->omega);
    {
        float den = pll->amplitude_published;
        if (den < amp_min) den = amp_min;
        error = (pll->sogi.alpha * cs + pll->sogi.beta * sn) / den;
    }
    error = clampf_local(error, -1.0f, 1.0f);
    pll->q_norm = error;
    pll->integrator += PLL_KI * CONTROL_TS * error;
    pll->integrator = clampf_local(pll->integrator,
                                   PLL_W_MIN - TWO_PI_F * 50.0f,
                                   PLL_W_MAX - TWO_PI_F * 50.0f);
    pll->omega = clampf_local(TWO_PI_F * 50.0f + pll->integrator +
                              PLL_KP * error, PLL_W_MIN, PLL_W_MAX);
    pll->theta += pll->omega * CONTROL_TS;
    if (pll->theta >= TWO_PI_F) pll->theta -= TWO_PI_F;
    if (pll->theta < 0.0f) pll->theta += TWO_PI_F;

    // 正交递推：sin(θ+Δθ) = sinθ·cosΔθ + cosθ·sinΔθ
    //            cos(θ+Δθ) = cosθ·cosΔθ - sinθ·sinΔθ
    sn_new = sn * pll->cos_dtheta + cs * pll->sin_dtheta;
    cs_new = cs * pll->cos_dtheta - sn * pll->sin_dtheta;
    pll->sin_theta = sn_new;
    pll->cos_theta = cs_new;
}

void pll_slow_update(SinglePhasePll *pll, float amp_min)
{
    // 1 kHz 慢速路径：幅值开方、正交状态归一化、重新计算相位增量、锁定判断。
    // 归一化抑制 20 步浮点递推的数值漂移，保证长期正交性。
    float mag;
    float dtheta;
    float amplitude;

    amplitude = sqrtf(pll->sogi.alpha * pll->sogi.alpha +
                      pll->sogi.beta * pll->sogi.beta);
    pll->amplitude = amplitude;
    pll->amplitude_published = amplitude;

    // 正交状态归一化
    mag = sqrtf(pll->sin_theta * pll->sin_theta +
                pll->cos_theta * pll->cos_theta);
    if (mag > 1e-9f)
    {
        pll->sin_theta /= mag;
        pll->cos_theta /= mag;
    }

    // 同步 theta：用归一化后的 sin_theta/cos_theta 重建相位角，
    // 消除简单累加与正交递推之间的数值漂移。1 kHz 执行，成本可接受。
    pll->theta = atan2f(pll->sin_theta, pll->cos_theta);
    if (pll->theta < 0.0f) pll->theta += TWO_PI_F;

    // 根据当前频率重新计算相位增量
    dtheta = pll->omega * CONTROL_TS;
    pll->sin_dtheta = sinf(dtheta);
    pll->cos_dtheta = cosf(dtheta);

