lululu-913/F280049_ACAC_Unit1/converter1.c
    // 锁定条件：幅值达标、相位误差 < 0.05、频率在 48~52 Hz
    if ((amplitude >= amp_min) && (fabsf(pll->q_norm) < 0.05f) &&
        (pll->omega >= TWO_PI_F * 48.0f) &&
        (pll->omega <= TWO_PI_F * 52.0f))
    {
        if (pll->lock_samples < 100UL) pll->lock_samples++;
    }
    else pll->lock_samples = 0UL;
    pll->locked = (pll->lock_samples >= 100UL) ? 1U : 0U;
}

void rms_update_fast(SlidingRms *r, float x)
{
    // 20 kHz 快速路径：只更新滑动窗的平方和与直流和，不调用 sqrtf。
    // sqrtf 在 1 kHz 慢速路径统一发布，节省约 30 ticks/通道 × 4 通道。
    float old = r->data[r->index];
    r->data[r->index] = x;
    r->index++;
    if (r->index >= RMS_WINDOW) r->index = 0U;
    if (r->filled < RMS_WINDOW)
    {
        r->filled++;
        old = 0.0f;
    }
    r->sum_sq += x * x - old * old;
    r->sum += x - old;
    if (r->sum_sq < 0.0f) r->sum_sq = 0.0f;
}

void rms_slow_update(SlidingRms *r)
{
    // 1 kHz 慢速路径：从已累积的平方和/直流和发布 RMS 和均值。
    if (r->filled > 0U)
    {
        r->rms = sqrtf(r->sum_sq / (float)r->filled);
        r->mean = r->sum / (float)r->filled;
    }
}

void mean_update_fast(SlidingRms *r, float x)
{
    // 轻量版滑动窗：仅累加直流和，不累加平方和。
    // 用于 Uo 通道——Uo RMS 由 SOGI 观察器提供，此通道只服务直流偏置保护。
    float old = r->data[r->index];
    r->data[r->index] = x;
    r->index++;
    if (r->index >= RMS_WINDOW) r->index = 0U;
    if (r->filled < RMS_WINDOW)
    {
        r->filled++;
        old = 0.0f;
    }
    r->sum += x - old;
}

void mean_slow_update(SlidingRms *r)
{
    // 仅发布均值，不计算 sqrtf。
    if (r->filled > 0U)
        r->mean = r->sum / (float)r->filled;
}

float pi_update(PiController *pi, float error, Uint16 integrate)
{
    // PI 输出先计算并限幅；只有 integrate 且输出未饱和，或误差方向有利于脱离
    // 饱和时才更新积分，形成基本的抗积分饱和。
    float unsat = pi->kp * error + pi->integral;
    float out = clampf_local(unsat, pi->out_min, pi->out_max);
    if (integrate && ((unsat == out) ||
        ((unsat > pi->out_max) && (error < 0.0f)) ||
        ((unsat < pi->out_min) && (error > 0.0f))))
    {
        pi->integral += pi->ki * CONTROL_TS * error;
        pi->integral = clampf_local(pi->integral, pi->out_min, pi->out_max);
    }
    return out;
}

// PI 控制器版本，允许调用者指定实际控制周期 dt。
// 外环以 1 kHz 运行（dt = 0.001f），不能用 CONTROL_TS（50 µs）。
float pi_update_dt(PiController *pi, float error, Uint16 integrate, float dt)
{
    float unsat = pi->kp * error + pi->integral;
    float out = clampf_local(unsat, pi->out_min, pi->out_max);
    if (integrate && ((unsat == out) ||
        ((unsat > pi->out_max) && (error < 0.0f)) ||
        ((unsat < pi->out_min) && (error > 0.0f))))
    {
        pi->integral += pi->ki * dt * error;
        pi->integral = clampf_local(pi->integral, pi->out_min, pi->out_max);
    }
    return out;
}

void pi_reset(PiController *pi)
{
    pi->integral = 0.0f;
}

void dq_lpf_update(DqLowPass *f, float x, float sn, float cs)
{
    // 将单相电流投影到 PLL 的 d/q 轴，再用一阶低通提取基波分量。
    f->d = FUND_LPF_A * f->d + (1.0f - FUND_LPF_A) * (2.0f * x * sn);
    f->q = FUND_LPF_A * f->q + (1.0f - FUND_LPF_A) * (2.0f * x * cs);
}

//********** 文本格式化 **********//
void clear_line(char *line)
{
    Uint16 i;
    for (i = 0U; i < 16U; i++) line[i] = ' ';
    line[16] = '\0';
}

void put_text(char *line, Uint16 pos, const char *s)
{
    while ((*s != '\0') && (pos < 16U)) line[pos++] = *s++;
}

void put_u2(char *line, Uint16 pos, Uint16 v)
{
    v %= 100U;
    if (pos < 16U) line[pos] = (char)('0' + v / 10U);
    if (pos + 1U < 16U) line[pos + 1U] = (char)('0' + v % 10U);
}

void put_fixed(char *line, Uint16 pos, float x, Uint16 decimals,
                      Uint16 width)
{
    Uint32 scale = 1UL;
    Uint32 value;
    Uint16 i;
    Uint16 negative = (x < 0.0f) ? 1U : 0U;
    for (i = 0U; i < decimals; i++) scale *= 10UL;
    value = (Uint32)(fabsf(x) * (float)scale + 0.5f);
    for (i = 0U; i < width; i++)
    {
        Uint16 at = pos + width - 1U - i;
        if (at >= 16U) continue;
        if ((decimals != 0U) && (i == decimals))
        {
            line[at] = '.';
        }
        else
        {
            line[at] = (char)('0' + (value % 10UL));
            value /= 10UL;
        }
    }
    if (negative && (pos < 16U)) line[pos] = '-';
}

const char *state_text(RunState state)
{
    switch (state)
    {
        case ST_SAFE: return "SAFE";
        case ST_PRECHECK: return "PRE ";
        case ST_INPUT_PLL: return "IPLL";
        case ST_WAIT_UO: return "WAIT";
        case ST_OUTPUT_PLL: return "OPLL";
        case ST_SS5_RAMP: return "SS5 ";
        case ST_SS5_HOLD: return "HOLD";
        case ST_SHARE_RAMP: return "SHAR";
        case ST_VOLT_RAMP: return "RAMP";
        case ST_RUN: return "RUN ";
        case ST_STOP_RAMP: return "STOP";
        case ST_WAIT_MASTER_OFF: return "WT0 ";
        case ST_DISCHARGE: return "DISC";
        case ST_GATE_TEST: return "GATE";
        case ST_FAULT: return "FLT ";
        default: return "BOOT";
    }
}

const char *profile_text(void)
{
#if DIRECTION_DIAG_8V
    return "8VDg";
#elif POWER_PROFILE == PROFILE_FULL
    return "FULL";
#elif AUX_TOPOLOGY == AUX_SHARED_LAB_DEBUG
#if HALF_CURRENT_STAGE == HALF_IHI
    return "HIDbg";
#else
    return "HSDbg";
#endif
#else
#if HALF_CURRENT_STAGE == HALF_IHI
    return "HIHI";
#else
    return "HSAFE";
#endif
#endif
}

//********** 硬件初始化 **********//
// 先把四个门极脚保持为普通 GPIO 低电平，完成 ePWM、CMPSS、TZ 后才切到 PWM 复用。
void hardware_init(void)
{
    InitGpio();
    GPIO_unlockPortConfig(GPIO_PORT_A, 0xFFFFFFFFUL);
    GPIO_unlockPortConfig(GPIO_PORT_B, 0xFFFFFFFFUL);
    GPIO_unlockPortConfig(GPIO_PORT_H, 0xFFFFFFFFUL);

    DINT;
    InitPieCtrl();
    IER = 0x0000U;
    IFR = 0x0000U;
    InitPieVectTable();

    EALLOW;
    // 采用 ADCB EOC2 作为中断入口，保证 ADCA SOC0-1 和 ADCB SOC0-2 均已转换完成。
    PieVectTable.ADCB1_INT = &adcB1ISR;
    AnalogSubsysRegs.DCDCCTL.bit.DCDCEN = 0U;
    EDIS;

    gpio_init_local();
    keys_init();
    OLED_Init();
    OLED_Clean();
    adc_init_local();
    pwm_init_local();
    cmpss_trip_init();
    // GPIO0..3 are connected to ePWM only after AQ and both asynchronous
    // one-shot paths are configured and already forced low.
    gpio_enable_pwm_mux();
    adc_soc_init();
}

void gpio_init_local(void)
{
    EALLOW;
    // Keep every possible gate pin as an ordinary low output until ePWM AQ/TZ
    // is fully initialized.  This prevents a reset-default PWM level from
    // reaching either UCC21520 during boot.
    GpioCtrlRegs.GPAGMUX1.bit.GPIO0 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 0U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO1 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 0U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 0U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 0U;
    GpioCtrlRegs.GPADIR.bit.GPIO0 = 1U;
    GpioCtrlRegs.GPADIR.bit.GPIO1 = 1U;
    GpioCtrlRegs.GPADIR.bit.GPIO2 = 1U;
    GpioCtrlRegs.GPADIR.bit.GPIO3 = 1U;
    GpioCtrlRegs.GPADIR.bit.GPIO4 = 1U;
    GpioCtrlRegs.GPADIR.bit.GPIO5 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO0 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO1 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO2 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO3 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO5 = 1U;

