lululu-913/F280049_ACAC_Unit1/converter1.c
    // ISR 脉宽测量用：GPIO6 (EPWM4A) 初始化为普通输出低电平。
    // 示波器接 GPIO6，ISR 入口置高、出口置低，脉宽即 ISR 执行时间。
    GpioCtrlRegs.GPAGMUX1.bit.GPIO6 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 0U;
    GpioCtrlRegs.GPADIR.bit.GPIO6 = 1U;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1U;
    EDIS;
}

void gpio_enable_pwm_mux(void)
{
    EALLOW;
    // Final mapping: GPIO0=Q1a, GPIO1=Q2a, GPIO2=Q1b, GPIO3=Q2b.
    GpioCtrlRegs.GPAGMUX1.bit.GPIO0 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO1 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1U;
    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0U;
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1U;
    EDIS;
}

void keys_init(void)
{
    const Uint16 pins[6] = {27U, 25U, 17U, 26U, 16U, 39U};
    Uint16 i;
    for (i = 0U; i < 6U; i++)
    {
        GPIO_setPadConfig(pins[i], GPIO_PIN_TYPE_PULLUP);
        GPIO_setDirectionMode(pins[i], GPIO_DIR_MODE_IN);
        GPIO_setQualificationMode(pins[i], GPIO_QUAL_6SAMPLE);
        GPIO_setQualificationPeriod(pins[i], 20U);
    }
}

void adc_init_local(void)
{
    /*
     * 仿真器异常断开后，CPU复位不一定能完全复位ADC模拟部分。
     * 因此先把ADCA、ADCB、ADCC明确掉电，再重新配置参考电压和上电。
     */

    EALLOW;

    // 先关闭三个ADC，强制模拟部分重新上电
    AdcaRegs.ADCCTL1.bit.ADCPWDNZ = 0U;
    AdcbRegs.ADCCTL1.bit.ADCPWDNZ = 0U;
    AdccRegs.ADCCTL1.bit.ADCPWDNZ = 0U;

    EDIS;

    DELAY_US(100U);

    /*================ ADCA =================*/

    ADC_setVREF(ADCA_BASE,
                ADC_REFERENCE_INTERNAL,
                ADC_REFERENCE_3_3V);

    EALLOW;

    AdcaRegs.ADCCTL2.bit.PRESCALE = 6U;
    AdcaRegs.ADCCTL1.bit.INTPULSEPOS = 1U;

    // 清除可能残留的ADC状态
    AdcaRegs.ADCINTFLGCLR.all = 0x000FU;
    AdcaRegs.ADCINTOVFCLR.all = 0x000FU;
    AdcaRegs.ADCSOCOVFCLR1.all = 0xFFFFU;

    AdcaRegs.ADCCTL1.bit.ADCPWDNZ = 1U;

    EDIS;

    DELAY_US(1000U);

    /*================ ADCB =================*/

    ADC_setVREF(ADCB_BASE,
                ADC_REFERENCE_INTERNAL,
                ADC_REFERENCE_3_3V);

    EALLOW;

    AdcbRegs.ADCCTL2.bit.PRESCALE = 6U;
    AdcbRegs.ADCCTL1.bit.INTPULSEPOS = 1U;

    AdcbRegs.ADCINTFLGCLR.all = 0x000FU;
    AdcbRegs.ADCINTOVFCLR.all = 0x000FU;
    AdcbRegs.ADCSOCOVFCLR1.all = 0xFFFFU;

    AdcbRegs.ADCCTL1.bit.ADCPWDNZ = 1U;

    EDIS;

    DELAY_US(1000U);

    /*================ ADCC =================*/

    /*
     * 虽然本程序暂时不用ADCC，但07110915初始化了ADCC后能恢复，
     * 所以先保留这一步，用于完整恢复内部模拟参考系统。
     */
    ADC_setVREF(ADCC_BASE,
                ADC_REFERENCE_INTERNAL,
                ADC_REFERENCE_3_3V);

    EALLOW;

    AdccRegs.ADCCTL2.bit.PRESCALE = 6U;
    AdccRegs.ADCCTL1.bit.INTPULSEPOS = 1U;

    AdccRegs.ADCINTFLGCLR.all = 0x000FU;
    AdccRegs.ADCINTOVFCLR.all = 0x000FU;
    AdccRegs.ADCSOCOVFCLR1.all = 0xFFFFU;

    AdccRegs.ADCCTL1.bit.ADCPWDNZ = 1U;

    EDIS;

    DELAY_US(1000U);
}

void adc_soc_init(void)
{
    EALLOW;
    // ADCA：SOC0=Ui(A0)，SOC1=Uo(A1)。
    AdcaRegs.ADCSOC0CTL.bit.CHSEL = 0U;
    AdcaRegs.ADCSOC0CTL.bit.ACQPS = 9U;
    AdcaRegs.ADCSOC0CTL.bit.TRIGSEL = 9U;    // ePWM3 SOCA
    AdcaRegs.ADCSOC1CTL.bit.CHSEL = 1U;
    AdcaRegs.ADCSOC1CTL.bit.ACQPS = 9U;
    AdcaRegs.ADCSOC1CTL.bit.TRIGSEL = 9U;

    // ADCB：SOC0=iL(B0)，SOC1=本机输出电流 Io(B1)。
    AdcbRegs.ADCSOC0CTL.bit.CHSEL = 0U;
    AdcbRegs.ADCSOC0CTL.bit.ACQPS = 9U;
    AdcbRegs.ADCSOC0CTL.bit.TRIGSEL = 9U;
    AdcbRegs.ADCSOC1CTL.bit.CHSEL = 1U;
    AdcbRegs.ADCSOC1CTL.bit.ACQPS = 9U;
    AdcbRegs.ADCSOC1CTL.bit.TRIGSEL = 9U;
#if UNIT_ROLE == UNIT_1
    // Unit1 的 SOC2=Itotal(B2)；Unit2 没有第三个传感器，重复 B1 只为保持
    // ADCB 的采样时序一致，不能把 Unit2 RESULT2 当作独立总电流。
    AdcbRegs.ADCSOC2CTL.bit.CHSEL = 2U;
#else
    AdcbRegs.ADCSOC2CTL.bit.CHSEL = 1U;
#endif
    AdcbRegs.ADCSOC2CTL.bit.ACQPS = 9U;
    AdcbRegs.ADCSOC2CTL.bit.TRIGSEL = 9U;

    // ADCB EOC2 触发中断：确保 ADCA SOC0-1 + ADCB SOC0-2 全部完成后再进 ISR。
    // 先禁用 ADCA INT1，避免误触发。
    AdcaRegs.ADCINTSEL1N2.bit.INT1E = 0U;
    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1U;
    AdcaRegs.ADCINTOVFCLR.bit.ADCINT1 = 1U;
    // ADCB EOC2 → ADCINT1
    AdcbRegs.ADCINTSEL1N2.bit.INT1SEL = 2U;
    AdcbRegs.ADCINTSEL1N2.bit.INT1E = 1U;
    AdcbRegs.ADCINTSEL1N2.bit.INT1CONT = 0U;
    AdcbRegs.ADCINTFLGCLR.bit.ADCINT1 = 1U;
    AdcbRegs.ADCINTOVFCLR.bit.ADCINT1 = 1U;
    EDIS;
}

void pwm_module_init(volatile struct EPWM_REGS *pwm, Uint16 master)
{
    // ePWM1 为同步主模块，ePWM2 跟随 ePWM1 相位；CMPA/CMPB 和 AQ 表均在
    // ZERO 影子装载，保证控制计算不会在一个载波周期中途改变门极真值。
    pwm->TBCTL.bit.CTRMODE = TB_FREEZE;
    pwm->TBCTL.bit.PHSEN = (master != 0U) ? TB_DISABLE : TB_ENABLE;
    pwm->TBCTL.bit.SYNCOSEL = (master != 0U) ? TB_CTR_ZERO : TB_SYNC_IN;
    pwm->TBCTL.bit.HSPCLKDIV = TB_DIV1;
    pwm->TBCTL.bit.CLKDIV = TB_DIV1;
    pwm->TBPHS.all = 0UL;
    pwm->TBCTR = 0U;
    pwm->TBPRD = PWM_TBPRD;
    pwm->CMPCTL.bit.SHDWAMODE = CC_SHADOW;
    pwm->CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    pwm->CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;
    pwm->CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    // AQ truth tables change between POS/NEG and the two ZC stages.  Keep
    // AQCTLA/B in shadow mode so those changes take effect at the same ZERO
    // as CMPA/B and continuous-force changes, never halfway through a cycle.
    pwm->AQCTL.all = 0U;
    pwm->AQCTL.bit.SHDWAQAMODE = 1U;
    pwm->AQCTL.bit.SHDWAQBMODE = 1U;
    pwm->AQCTL.bit.LDAQAMODE = 0U;       // load AQCTLA on ZERO
    pwm->AQCTL.bit.LDAQBMODE = 0U;       // load AQCTLB on ZERO
    pwm->CMPA.bit.CMPA = (Uint16)(PWM_TBPRD * 0.10f);
    pwm->CMPB.bit.CMPB = (Uint16)(PWM_TBPRD * 0.10f) + PWM_DEAD_TICKS;
    pwm->AQCTLA.all = 0U;
    pwm->AQCTLB.all = 0U;
    pwm->AQSFRC.bit.RLDCSF = 0U;             // continuous force loads at ZERO
    pwm->AQCSFRC.bit.CSFA = 1U;              // force low
    pwm->AQCSFRC.bit.CSFB = 1U;
    pwm->DBCTL.bit.OUT_MODE = 0U;             // dead-band permanently bypassed
    pwm->TZCTL.bit.TZA = TZ_FORCE_LO;
    pwm->TZCTL.bit.TZB = TZ_FORCE_LO;
    pwm->TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;
}

void pwm_init_local(void)
{
    EALLOW;
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0U;
    CpuSysRegs.PCLKCR2.bit.EPWM1 = 1U;
    CpuSysRegs.PCLKCR2.bit.EPWM2 = 1U;
    CpuSysRegs.PCLKCR2.bit.EPWM3 = 1U;
    pwm_module_init(&EPwm1Regs, 1U);
    pwm_module_init(&EPwm2Regs, 0U);

    // ePWM3 is synchronized but never muxed to a gate pin.
    EPwm3Regs.TBCTL.bit.CTRMODE = TB_FREEZE;
    EPwm3Regs.TBCTL.bit.PHSEN = TB_ENABLE;
    EPwm3Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
    EPwm3Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;
    EPwm3Regs.TBCTL.bit.CLKDIV = TB_DIV1;
    EPwm3Regs.TBPHS.all = 0UL;
    EPwm3Regs.TBCTR = 0U;
    EPwm3Regs.TBPRD = PWM_TBPRD;
    EPwm3Regs.CMPA.bit.CMPA = 0U;
    EPwm3Regs.ETSEL.bit.SOCAEN = 1U;
    // 与已验证 main.c 一致：CTR=CMPA 上数，CMPA=0，即 ZERO 点采样。
    EPwm3Regs.ETSEL.bit.SOCASEL = 2U;
    EPwm3Regs.ETPS.bit.SOCAPRD = ET_1ST;
    EPwm3Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;
    EDIS;

    pwm_force_off();           // 确保所有门极驱动信号为低
}

