lululu-913/F280049_ACAC_Unit1/converter1.c
void cmpss_trip_init(void)
{
    // CMPSS7 同时接收 ADCINB0 的高、低电流比较结果。低阈值输出反相，高低
    // 比较器经短多数表决滤波后 OR，再由 XBAR TRIP7→DCAEVT1→ePWM OST
    // 关断四路门极；滤波不改变 ±IL_CMPSS_TRIP 阈值。
    Uint16 high_code;
    Uint16 low_code;
    float high_f = IL_ADC_OFFSET + IL_ADC_GAIN * IL_CMPSS_TRIP;
    float low_f = IL_ADC_OFFSET - IL_ADC_GAIN * IL_CMPSS_TRIP;

    high_code = (Uint16)clampf_local(high_f, 1.0f, 4094.0f);
    low_code = (Uint16)clampf_local(low_f, 1.0f, 4094.0f);

    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_CMPSS7);
    EALLOW;
    AnalogSubsysRegs.CMPHPMXSEL.bit.CMP7HPMXSEL = 3U; // CMPSS7 HP <- ADCINB0
    AnalogSubsysRegs.CMPLPMXSEL.bit.CMP7LPMXSEL = 3U; // CMPSS7 LP <- ADCINB0
    EDIS;
    CMPSS_disableModule(CMPSS7_BASE);
    CMPSS_configHighComparator(CMPSS7_BASE, CMPSS_INSRC_DAC);
    CMPSS_configLowComparator(CMPSS7_BASE, CMPSS_INSRC_DAC | CMPSS_INV_INVERTED);
    CMPSS_configDAC(CMPSS7_BASE,
                    CMPSS_DACVAL_SYSCLK | CMPSS_DACREF_VDDA | CMPSS_DACSRC_SHDW);
    CMPSS_setDACValueHigh(CMPSS7_BASE, high_code);
    CMPSS_setDACValueLow(CMPSS7_BASE, low_code);
    CMPSS_setHysteresis(CMPSS7_BASE, 1U);
    CMPSS_enableModule(CMPSS7_BASE);
    CMPSS_configFilterHigh(CMPSS7_BASE, IL_CMPSS_FILTER_PRESCALE,
                           IL_CMPSS_FILTER_WINDOW, IL_CMPSS_FILTER_THRESHOLD);
    CMPSS_configFilterLow(CMPSS7_BASE, IL_CMPSS_FILTER_PRESCALE,
                          IL_CMPSS_FILTER_WINDOW, IL_CMPSS_FILTER_THRESHOLD);
    CMPSS_initFilterHigh(CMPSS7_BASE);
    CMPSS_initFilterLow(CMPSS7_BASE);
    CMPSS_clearFilterLatchHigh(CMPSS7_BASE);
    CMPSS_clearFilterLatchLow(CMPSS7_BASE);
    CMPSS_configOutputsHigh(CMPSS7_BASE,
                            CMPSS_TRIP_FILTER | CMPSS_TRIPOUT_FILTER);
    CMPSS_configOutputsLow(CMPSS7_BASE,
                           CMPSS_TRIP_FILTER | CMPSS_TRIPOUT_FILTER);

    XBAR_disableEPWMMux(XBAR_TRIP7, 0xFFFFFFFFUL);
    XBAR_setEPWMMuxConfig(XBAR_TRIP7, XBAR_EPWM_MUX12_CMPSS7_CTRIPH_OR_L);
    XBAR_invertEPWMSignal(XBAR_TRIP7, false);
    XBAR_enableEPWMMux(XBAR_TRIP7, XBAR_MUX12);

    EPWM_selectDigitalCompareTripInput(EPWM1_BASE, EPWM_DC_TRIP_TRIPIN7,
                                       EPWM_DC_TYPE_DCAH);
    EPWM_selectDigitalCompareTripInput(EPWM2_BASE, EPWM_DC_TRIP_TRIPIN7,
                                       EPWM_DC_TYPE_DCAH);
    EPWM_setTripZoneDigitalCompareEventCondition(EPWM1_BASE,
                 EPWM_TZ_DC_OUTPUT_A1, EPWM_TZ_EVENT_DCXH_HIGH);
    EPWM_setTripZoneDigitalCompareEventCondition(EPWM2_BASE,
                 EPWM_TZ_DC_OUTPUT_A1, EPWM_TZ_EVENT_DCXH_HIGH);
    EPWM_setDigitalCompareEventSource(EPWM1_BASE, EPWM_DC_MODULE_A,
                 EPWM_DC_EVENT_1, EPWM_DC_EVENT_SOURCE_ORIG_SIGNAL);
    EPWM_setDigitalCompareEventSource(EPWM2_BASE, EPWM_DC_MODULE_A,
                 EPWM_DC_EVENT_1, EPWM_DC_EVENT_SOURCE_ORIG_SIGNAL);
    EPWM_setDigitalCompareEventSyncMode(EPWM1_BASE, EPWM_DC_MODULE_A,
                 EPWM_DC_EVENT_1, EPWM_DC_EVENT_INPUT_NOT_SYNCED);
    EPWM_setDigitalCompareEventSyncMode(EPWM2_BASE, EPWM_DC_MODULE_A,
                 EPWM_DC_EVENT_1, EPWM_DC_EVENT_INPUT_NOT_SYNCED);
    EPWM_enableTripZoneSignals(EPWM1_BASE, EPWM_TZ_SIGNAL_DCAEVT1);
    EPWM_enableTripZoneSignals(EPWM2_BASE, EPWM_TZ_SIGNAL_DCAEVT1);
    EPWM_setTripZoneAction(EPWM1_BASE, EPWM_TZ_ACTION_EVENT_TZA,
                           EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM1_BASE, EPWM_TZ_ACTION_EVENT_TZB,
                           EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM2_BASE, EPWM_TZ_ACTION_EVENT_TZA,
                           EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM2_BASE, EPWM_TZ_ACTION_EVENT_TZB,
                           EPWM_TZ_ACTION_LOW);
    pwm_force_off();           // 确保所有门极驱动信号为低
}

void controllers_init(void)
{
    memset(&pll_ui, 0, sizeof(pll_ui));
    memset(&pll_uo, 0, sizeof(pll_uo));
    memset(&uo_observer, 0, sizeof(uo_observer));
    memset(&rms_il, 0, sizeof(rms_il));
    memset(&rms_io, 0, sizeof(rms_io));
    memset(&rms_it, 0, sizeof(rms_it));
    memset(&rms_uo, 0, sizeof(rms_uo));
    memset(keys_state, 0, sizeof(keys_state));

    pll_ui.omega = TWO_PI_F * 50.0f;
    pll_ui.cos_theta = 1.0f;
    pll_ui.sin_theta = 0.0f;
    pll_ui.sin_dtheta = 0.0157073f;
    pll_ui.cos_dtheta = 0.9998766f;
    pll_ui.amplitude_published = 5.0f;
    pll_uo.omega = TWO_PI_F * 50.0f;
    pll_uo.cos_theta = 1.0f;
    pll_uo.sin_theta = 0.0f;
    pll_uo.sin_dtheta = 0.0157073f;
    pll_uo.cos_dtheta = 0.9998766f;
    pll_uo.amplitude_published = 5.0f;
    pi_id.kp = CURRENT_KP;
    pi_id.ki = CURRENT_LOOP_INTEGRAL_ENABLE ? CURRENT_KI : 0.0f;
    pi_id.out_min = -5.0f; pi_id.out_max = 5.0f;
    pi_vd.kp = VOLTAGE_KP;
    pi_vd.ki = VOLTAGE_KI;
    pi_vd.integral = 0.0f;
    pi_vd.out_min = -0.50f;
    pi_vd.out_max =  0.90f;

    pi_vq.kp = 5.0e-4f;
    pi_vq.ki = 5.0e-3f;
    pi_vq.integral = 0.0f;
    pi_vq.out_min = -0.05f;
    pi_vq.out_max =  0.05f;
    pi_sd.kp = SHARE_KP; pi_sd.ki = SHARE_KI;
    pi_sd.out_min = -I_BRANCH_CMD_MAX; pi_sd.out_max = I_BRANCH_CMD_MAX;
    pi_sq = pi_sd;
}

//********** PWM 门极时序 **********//
// ePWM1A/B 对应 Q1a/Q2a，ePWM2A/B 对应 Q1b/Q2b。
// AQ 表采用 ZERO 影子装载；过零换向分为 ZC_A、ZC_B 两个载波周期。
void pwm_force_off(void)
{
    // OST 是最终硬件关断；同时把 AQCSFRC 立即置低，避免清 OST 时恢复旧的
    // PWM 图样。只有状态机满足安全条件时才允许后续重新装载 AQ。
    EPWM_forceTripZoneEvent(EPWM1_BASE, EPWM_TZ_FORCE_EVENT_OST);
    EPWM_forceTripZoneEvent(EPWM2_BASE, EPWM_TZ_FORCE_EVENT_OST);
    // Keep the underlying AQ state low as well.  RLDCSF=3 is the immediate
    // continuous-force load; it prevents an old active pattern from becoming
    // visible if the OST is ever cleared before the next carrier ZERO.
    EPwm1Regs.AQSFRC.bit.RLDCSF = 3U;
    EPwm2Regs.AQSFRC.bit.RLDCSF = 3U;
    EPwm1Regs.AQCSFRC.bit.CSFA = 1U;
    EPwm1Regs.AQCSFRC.bit.CSFB = 1U;
    EPwm2Regs.AQCSFRC.bit.CSFA = 1U;
    EPwm2Regs.AQCSFRC.bit.CSFB = 1U;
    gate_state = GATE_BLOCKED;
    gate_start_pending = 0U;
}

// 每 20 kHz ISR 调用：连续采样安全检查，累计 trip_clear_safe_count。
// 满足 2000 次（100 ms）连续安全后，pwm_clear_ost() 才允许清除 OST。
Uint16 trip_clear_qualify_fast(void)
{
#if POWER_STAGE_ENABLE == 1
    Uint16 raw_ok = ((meas.raw_ui >= 64U) && (meas.raw_ui <= 4031U) &&
                     (meas.raw_uo >= 64U) && (meas.raw_uo <= 4031U) &&
                     (meas.raw_il >= 64U) && (meas.raw_il <= 4031U) &&
                     (meas.raw_io >= 64U) && (meas.raw_io <= 4031U));
    Uint16 cmp_ok = (CMPSS_getStatus(CMPSS7_BASE) &
                     (CMPSS_STS_HI_FILTOUT | CMPSS_STS_LO_FILTOUT)) == 0U;
    if (!raw_ok || !cmp_ok || (fabsf(meas.il) > 0.8f * IL_CMPSS_TRIP) ||
        (pll_ui.locked == 0U))
    {
        trip_clear_safe_count = 0U;
        return 0U;
    }
    if (trip_clear_safe_count < 2000U) trip_clear_safe_count++;
    return (trip_clear_safe_count >= 2000U) ? 1U : 0U;
#else
    return 0U;
#endif
}

Uint16 pwm_clear_ost(void)
{
#if POWER_STAGE_ENABLE == 1
    if (trip_clear_safe_count < 2000U) return 0U;

    // The new AQ/CSF image was written with shadow load-on-ZERO.  Keep the
    // immediate low force in place until that image has had a carrier ZERO to
    // load, then release OST; the following cycle is the first possible gate.
    EPWM_clearOneShotTripZoneFlag(EPWM1_BASE, EPWM_TZ_OST_FLAG_DCAEVT1);
    EPWM_clearOneShotTripZoneFlag(EPWM2_BASE, EPWM_TZ_OST_FLAG_DCAEVT1);
    EPWM_clearTripZoneFlag(EPWM1_BASE, EPWM_TZ_FLAG_OST |
                           EPWM_TZ_FLAG_DCAEVT1 | EPWM_TZ_INTERRUPT);
    EPWM_clearTripZoneFlag(EPWM2_BASE, EPWM_TZ_FLAG_OST |
                           EPWM_TZ_FLAG_DCAEVT1 | EPWM_TZ_INTERRUPT);
    trip_clear_safe_count = 0U;
    return 1U;
#else
    // Deliberate commissioning lock: no executable path clears OST.
    pwm_force_off();           // 确保所有门极驱动信号为低
    return 0U;
#endif
}

void pwm_force_pair(volatile struct EPWM_REGS *pwm, Uint16 a_force,
                           Uint16 b_force)
{
    pwm->AQSFRC.bit.RLDCSF = 0U; // shadow-to-active at ZERO
    pwm->AQCSFRC.bit.CSFA = a_force;
    pwm->AQCSFRC.bit.CSFB = b_force;
}

