lululu-913/F280049_ACAC_Unit1/converter1.c
void pwm_set_aq_active(volatile struct EPWM_REGS *pwm)
{
    // p: high from ZERO to CMPA(up), high again at CMPA(down).
    // pbar: low from ZERO to CMPB(up), low again at CMPB(down).
    pwm->AQCTLA.all = 0U;
    pwm->AQCTLA.bit.ZRO = AQ_SET;
    pwm->AQCTLA.bit.CAU = AQ_CLEAR;
    pwm->AQCTLA.bit.CAD = AQ_SET;
    pwm->AQCTLB.all = 0U;
    pwm->AQCTLB.bit.ZRO = AQ_CLEAR;
    pwm->AQCTLB.bit.CBU = AQ_SET;
    pwm->AQCTLB.bit.CBD = AQ_CLEAR;
    pwm_force_pair(pwm, 0U, 0U);
}

void pwm_set_aq_delayed_high(volatile struct EPWM_REGS *pwm,
                                     Uint16 output_a, Uint16 ticks)
{
    pwm->CMPA.bit.CMPA = ticks;
    pwm->CMPB.bit.CMPB = ticks;
    if (output_a != 0U)
    {
        pwm->AQCTLA.all = 0U;
        pwm->AQCTLA.bit.ZRO = AQ_CLEAR;
        pwm->AQCTLA.bit.CAU = AQ_SET;
    }
    else
    {
        pwm->AQCTLB.all = 0U;
        pwm->AQCTLB.bit.ZRO = AQ_CLEAR;
        pwm->AQCTLB.bit.CBU = AQ_SET;
    }
}

void pwm_set_normal(HalfPolarity half, float duty)
{
    // 正常运行时，一组半桥输出 PWM 互补，另一组保持导通；half 决定当前
    // 输入电压正、负半周所使用的开关组。
    Uint16 cmpa;
    Uint16 cmpb;
    duty = clampf_local(duty, PWM_D_MIN, PWM_D_MAX);
    cmpa = (Uint16)(duty * (float)PWM_TBPRD);
    cmpb = cmpa + PWM_DEAD_TICKS;
    if (cmpb >= PWM_TBPRD) cmpb = PWM_TBPRD - 1U;

    EPwm1Regs.CMPA.bit.CMPA = cmpa;
    EPwm1Regs.CMPB.bit.CMPB = cmpb;
    EPwm2Regs.CMPA.bit.CMPA = cmpa;
    EPwm2Regs.CMPB.bit.CMPB = cmpb;

    if (half == HALF_POS)
    {
        pwm_set_aq_active(&EPwm1Regs);       // Q1a=p, Q2a=pbar
        pwm_force_pair(&EPwm2Regs, 2U, 2U); // Q1b/Q2b continuously on
    }
    else
    {
        pwm_force_pair(&EPwm1Regs, 2U, 2U); // Q1a/Q2a continuously on
        pwm_set_aq_active(&EPwm2Regs);       // Q1b=p, Q2b=pbar
    }
}

void pwm_set_zc_a(HalfPolarity next_half)
{
    // ZC_A：先保持必要的回路导通，再把新半周的第一只 MOS 延迟 25 TBCLK 打开。
    // First transition period keeps both output-side MOSFETs on.  The old
    // constant input MOSFET is low at ZERO; the new one rises at Nzc.
    if (next_half == HALF_NEG)
    {
        pwm_force_pair(&EPwm1Regs, 0U, 2U);  // Q2a high; Q1a via AQ
        pwm_set_aq_delayed_high(&EPwm1Regs, 1U, PWM_ZC_TICKS);
        pwm_force_pair(&EPwm2Regs, 1U, 2U);  // Q1b low, Q2b high
    }
    else
    {
        pwm_force_pair(&EPwm1Regs, 1U, 2U);  // Q1a low, Q2a high
        pwm_force_pair(&EPwm2Regs, 0U, 2U);  // Q2b high; Q1b via AQ
        pwm_set_aq_delayed_high(&EPwm2Regs, 1U, PWM_ZC_TICKS);
    }
}

void pwm_set_zc_b(HalfPolarity next_half)
{
    // ZC_B：关断旧半周的恒导通器件，并以同样的死区切换到新半周。
    // Second transition period turns off the newly active Q2 at ZERO and
    // opens its Q1 only after the independent AQ dead interval.
    if (next_half == HALF_NEG)
    {
        pwm_force_pair(&EPwm1Regs, 2U, 2U);  // positive pair both on
        pwm_force_pair(&EPwm2Regs, 0U, 1U);  // Q2b low; Q1b via AQ
        pwm_set_aq_delayed_high(&EPwm2Regs, 1U, PWM_DEAD_TICKS);
    }
    else
    {
        pwm_force_pair(&EPwm1Regs, 0U, 1U);  // Q2a low; Q1a via AQ
        pwm_set_aq_delayed_high(&EPwm1Regs, 1U, PWM_DEAD_TICKS);
        pwm_force_pair(&EPwm2Regs, 2U, 2U);  // negative pair both on
    }
}

void request_half_change(HalfPolarity desired_half)
{
    // 只有检测到目标半周与当前半周不同才启动换向；换向期间冻结电流 PI 积分。
    if ((gate_state == GATE_ACTIVE) && (desired_half != half))
    {
        next_half = desired_half;
        gate_state = GATE_ZC_A;
        zc_stage_periods = 1U;     // 防止同一次 ISR 立即推进到 ZC_B
        pwm_set_zc_a(desired_half);
        pi_reset(&pi_id);
        debug_zc_a_count++;
    }
}

void gate_sequence_update(void)
{
    // ZC_A/ZC_B 各保持至少一个 ISR 周期，确保 AQ 影子寄存器在下一次
    // PWM ZERO 时生效，再提交下一阶段。
    if (((gate_state == GATE_ZC_A) ||
         (gate_state == GATE_ZC_B)) &&
        (zc_stage_periods != 0U))
    {
        zc_stage_periods--;
        return;
    }

    if (gate_state == GATE_ZC_A)
    {
        pwm_set_zc_b(next_half);
        gate_state = GATE_ZC_B;
        debug_zc_b_count++;
    }
    else if (gate_state == GATE_ZC_B)
    {
        half = next_half;
        pwm_set_normal(half, duty);
        gate_state = GATE_ACTIVE;
        debug_zc_done_count++;
    }
    else if (gate_state == GATE_ACTIVE)
    {
        pwm_set_normal(half, duty);
    }
}

//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//********** ADC 采样与信号处理 **********//
// ADCA0/1：Ui/Uo；ADCB0/1/2：iL/Io/Itotal（Unit2 的 SOC2 重复 Io）。
// 所有 SOC 由 ePWM3 SOCA 同步触发，ADCA SOC1 完成后进入 20 kHz ISR。
void sample_and_calibrate(void)
{
    // 直接写入 meas 字段，避免每次 ISR 复制整个 Measurements 结构体。
    // RMS/均值字段由 signal_processing_slow 在 1 kHz 更新，此处不覆盖。
    meas.raw_ui = AdcaResultRegs.ADCRESULT0;
    meas.raw_uo = AdcaResultRegs.ADCRESULT1;
    meas.raw_il = AdcbResultRegs.ADCRESULT0;
    meas.raw_io = AdcbResultRegs.ADCRESULT1;
    meas.raw_it = AdcbResultRegs.ADCRESULT2;

    meas.ui = UI_ADC_POLARITY * (((float)meas.raw_ui - UI_ADC_OFFSET) / UI_ADC_GAIN);
    meas.uo = UO_ADC_POLARITY * (((float)meas.raw_uo - UO_ADC_OFFSET) / UO_ADC_GAIN);
    meas.il = IL_ADC_POLARITY * (((float)meas.raw_il - IL_ADC_OFFSET) / IL_ADC_GAIN);
    meas.io = IO_ADC_POLARITY * (((float)meas.raw_io - IO_ADC_OFFSET) / IO_ADC_GAIN);
#if UNIT_ROLE == UNIT_1
    meas.it = IT_ADC_POLARITY * (((float)meas.raw_it - IT_ADC_OFFSET) / IT_ADC_GAIN);
#else
    meas.it = 0.0f;
#endif
}

void signal_processing_fast(void)
{
    // 20 kHz 快速路径：SOGI 更新、PLL 相位/频率递推、dq 投影、RMS 滑动窗累加。
    // 不使用 sinf/cosf/sqrtf；dq 变换复用 PLL 缓存的正交状态。
    float ui_amp_min = DIRECTION_DIAG_8V ? 2.0f : 5.0f;

    pll_update_fast(&pll_ui, meas.ui, ui_amp_min);
    sogi_update(&uo_observer, meas.uo, pll_ui.omega);

    if (is_share_role() != 0U)
    {
        pll_update_fast(&pll_uo, meas.uo, 2.0f);
        dq_lpf_update(&it_dq, meas.it, pll_uo.sin_theta, pll_uo.cos_theta);
        dq_lpf_update(&io_dq, meas.io, pll_uo.sin_theta, pll_uo.cos_theta);
    }

    rms_update_fast(&rms_il, meas.il);
    rms_update_fast(&rms_io, meas.io);
    if (is_share_role() != 0U)
        rms_update_fast(&rms_it, meas.it);
    mean_update_fast(&rms_uo, meas.uo);
}

void signal_processing_slow(void)
{
    // 1 kHz 慢速路径：PLL 幅值/锁定/归一化/Δθ 重算、dq 基波 RMS 发布、
    // RMS/均值发布、uo_observer 幅值发布。
    float ui_amp_min = DIRECTION_DIAG_8V ? 2.0f : 5.0f;

    pll_slow_update(&pll_ui, ui_amp_min);

    if (is_share_role() != 0U)
    {
        pll_slow_update(&pll_uo, 2.0f);
        it_fund_rms = sqrtf(it_dq.d * it_dq.d +
                              it_dq.q * it_dq.q) * INV_SQRT2_F;
        io_fund_rms = sqrtf(io_dq.d * io_dq.d +
                              io_dq.q * io_dq.q) * INV_SQRT2_F;
    }

