lululu-913/F280049_ACAC_Unit1/converter1.c
    rms_slow_update(&rms_il);
    rms_slow_update(&rms_io);
    if (is_share_role() != 0U)
        rms_slow_update(&rms_it);
    mean_slow_update(&rms_uo);

    meas.ui_rms = pll_ui.amplitude * INV_SQRT2_F;
    meas.uo_rms = sqrtf(uo_observer.alpha * uo_observer.alpha +
                          uo_observer.beta * uo_observer.beta) * INV_SQRT2_F;
    meas.il_rms = rms_il.rms;
    meas.io_rms = rms_io.rms;
    meas.it_rms = (is_share_role() != 0U) ? rms_it.rms : 0.0f;
    meas.il_mean = rms_il.mean;
    meas.uo_mean = rms_uo.mean;
}

void software_protection_fast(void)
{
    // 20 kHz 快速路径：仅保留 ADC 越界、CMPSS 硬件标志、iL 单采样峰值。
    // Io/It/Uo 峰值已删除（分别由 RMS 慢速保护、硬件过流和动态过压覆盖）。
    Uint16 raw_bad;

    raw_bad = ((meas.raw_ui < 32U) || (meas.raw_ui > 4063U) ||
               (meas.raw_uo < 32U) || (meas.raw_uo > 4063U) ||
               (meas.raw_il < 32U) || (meas.raw_il > 4063U) ||
               (meas.raw_io < 32U) || (meas.raw_io > 4063U)) ? 1U : 0U;
#if UNIT_ROLE == UNIT_1
    if ((meas.raw_it < 32U) || (meas.raw_it > 4063U)) raw_bad = 1U;
#endif
    if (raw_bad != 0U)
    {
        if (++adc_bad_count >= 3U) latch_fault(FAULT_ADC);
    }
    else adc_bad_count = 0U;

    if ((EPwm1Regs.TZFLG.bit.DCAEVT1 != 0U) ||
        (EPwm2Regs.TZFLG.bit.DCAEVT1 != 0U))
    {
        debug_il_fault_source =
            ((EPwm1Regs.TZFLG.bit.DCAEVT1 != 0U) ? 1U : 0U) |
            ((EPwm2Regs.TZFLG.bit.DCAEVT1 != 0U) ? 2U : 0U);
        debug_cmpss_status_at_fault = Cmpss7Regs.COMPSTS.all;
        debug_epwm1_tz_at_fault = EPwm1Regs.TZFLG.all;
        debug_epwm2_tz_at_fault = EPwm2Regs.TZFLG.all;
        latch_fault(FAULT_IL_PK);
    }

    // iL 瞬时峰值：只在闸极开启后生效，单采样即锁故障。
    if ((gate_state == GATE_ACTIVE) && (fabsf(meas.il) >= IL_SW_FAST_LIMIT))
    {
        debug_il_fault_source = 4U;
        latch_fault(FAULT_IL_PK);
    }
}

void software_protection_slow(void)
{
    // 1 kHz 慢速路径：RMS 过流、动态过压、输入窗口、PLL 失锁、母线丢失、
    // 直流偏置。这些保护依赖已发布的 RMS/均值，1 kHz 更新率足够。
    float dynamic_ov;

    if (!((run_state == ST_SS5_RAMP) ||
          (run_state == ST_SS5_HOLD) ||
          (run_state == ST_VOLT_RAMP) ||
          (run_state == ST_SHARE_RAMP) ||
          (run_state == ST_RUN) ||
          (run_state == ST_STOP_RAMP))) return;

    if (meas.il_rms >= IL_RMS_TRIP)
    {
        if (++il_rms_count >= 40U) latch_fault(FAULT_IL_RMS);
    }
    else il_rms_count = 0U;
    if (meas.io_rms >= IO_RMS_TRIP)
    {
        if (++io_rms_count >= 40U) latch_fault(FAULT_IO);
    }
    else io_rms_count = 0U;
#if UNIT_ROLE == UNIT_1
    if (meas.it_rms >= IT_RMS_TRIP)
    {
        if (++it_rms_count >= 40U) latch_fault(FAULT_IT);
    }
    else it_rms_count = 0U;
#endif

    dynamic_ov = u_ref_active +
                 fmaxf(1.5f, 0.20f * u_ref_active);

    dynamic_ov = fminf(dynamic_ov, UO_RMS_HARD_MAX);

    if (is_voltage_role() == 0U)
    {
        dynamic_ov = UO_RMS_HARD_MAX;
    }

    /*
     * 启动爬升阶段不能让保护线跟着尚未爬升完成的
     * u_ref_active降得过低，应参考最终目标值设置下限。
     */
    if (run_state == ST_VOLT_RAMP)
    {
        float ramp_ov_min = 1.30f * effective_u_ref();

        dynamic_ov = fmaxf(dynamic_ov, ramp_ov_min);
    }

    if ((run_state == ST_SS5_RAMP) ||
        (run_state == ST_SS5_HOLD))
    {
        dynamic_ov = 7.0f;
    }

    debug_dynamic_ov = dynamic_ov;
    debug_u_ref_active = u_ref_active;

    /* 连续超过10 ms才确认 */
    if (meas.uo_rms > dynamic_ov)
    {
        if (++uo_pk_count >= 10U)
        {
            latch_fault(FAULT_UO_OV);
        }
    }
    else
    {
        uo_pk_count = 0U;
    }

    if (input_run_ok() == 0U)
    {
        if (++ui_bad_count >= 60U) latch_fault(FAULT_UI);
    }
    else ui_bad_count = 0U;

    if ((pll_ui.omega < TWO_PI_F * 46.0f) ||
        (pll_ui.omega > TWO_PI_F * 54.0f) || (pll_ui.locked == 0U))
    {
        if (++pll_bad_count >= 60U) latch_fault(FAULT_PLL);
    }
    else pll_bad_count = 0U;

    // 母线丢失保护：并联模式下母线电压低于 3.0 V 连续 5 ms 即锁故障。
    if (is_share_role() && bus_valid &&
        (run_state == ST_SHARE_RAMP || run_state == ST_RUN))
    {
        if (meas.uo_rms < 3.0f)
        {
            if (++bus_lost_count >= 5U) latch_fault(FAULT_BUS_LOST);
        }
        else bus_lost_count = 0U;
    }
    else bus_lost_count = 0U;

    // 直流偏置保护：iL/uo 均值偏离零超过阈值连续 100 ms 即锁故障。
    if ((fabsf(meas.il_mean) > 0.30f) || (fabsf(meas.uo_mean) > 0.50f))
    {
        if (++dc_bad_count >= 100U) latch_fault(FAULT_DC_OFFSET);
    }
    else dc_bad_count = 0U;
}

//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////

// ADCA INT1：SOC1 完成后读取两路电压和三路 B 组电流结果。
// 双速率架构：20 kHz 快速路径每周期执行；1 kHz 慢速路径每 20 周期执行。
// 快速路径仅含 ADC 标定、SOGI/PLL 相位递推、dq 投影、RMS 累加、
// 瞬时峰值保护、电流内环和门极提交——不调用 sinf/cosf/sqrtf。
__interrupt void adcB1ISR(void)
{
    GpioDataRegs.GPASET.bit.GPIO6 = 1U;  // ISR 脉宽测量：入口置高

    // ---- 20 kHz 快速路径 ----
    sample_and_calibrate();
    signal_processing_fast();
    software_protection_fast();
    trip_clear_qualify_fast();

    // ---- 1 kHz 慢速路径：分散到不同载波周期，避免叠加 ----
    isr_heartbeat++;
    switch (sample_div)
    {
        case 0U:
            signal_processing_slow();
            if (tick_1ms < 100U) tick_1ms++;
            if (++tick_div_5ms >= 5U) {
                tick_div_5ms = 0U;
                if (tick_5ms < 20U) tick_5ms++;
            }
            if (++tick_div_100ms >= 100U) {
                tick_div_100ms = 0U;
                if (tick_100ms < 4U) tick_100ms++;
            }
            break;
        case 6U:
            software_protection_slow();
            break;
        case 12U:
            control_update_slow();
            break;
        default:
            break;
    }
    if (++sample_div >= 20U) sample_div = 0U;

    // ---- 20 kHz 快速路径（续）：电流内环 + 门极 shadow 提交 ----
    control_update_fast();
    gate_sequence_update();

    // ADCINT 溢出检查：ADCB EOC2 触发，检查 ADCB 的溢出标志。
    AdcbRegs.ADCINTFLGCLR.bit.ADCINT1 = 1U;
    if (AdcbRegs.ADCINTOVF.bit.ADCINT1 != 0U)
    {
        debug_adc_ovf_count++;
        AdcbRegs.ADCINTOVFCLR.bit.ADCINT1 = 1U;
        AdcbRegs.ADCINTFLGCLR.bit.ADCINT1 = 1U;
        latch_fault(FAULT_CPU);
    }
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1U;  // ISR 脉宽测量：出口置低
}

// 外环：电压或分流；前馈：Co 电流前馈 — 1 kHz 慢速路径。
//********** 外环控制 (1kHz) **********//
void control_update_slow(void)
{
#if GATE_OPEN_LOOP_TEST
    if (run_state == ST_GATE_TEST) return;
#endif
    // 1 kHz 慢速路径：dq 变换、电压/分流外环 PI、Co 电流前馈。
    // 结果 iconv_ref_held / dff_held 保持 20 个快速周期供电流内环使用。
    // sin/cos 复用 PLL 缓存的正交状态，不调用 sinf/cosf。
    float sn = pll_ui.sin_theta;
    float cs = pll_ui.cos_theta;
    float ui_amp = fmaxf(pll_ui.amplitude, 1.0f);
    float uo_amp;
    float dff;
    float iconv_ref = 0.0f;
    Uint16 ctrl_active;

