lululu-913/F280049_ACAC_Unit1/converter1.c
    uo_amp = sqrtf(uo_observer.alpha * uo_observer.alpha +
                   uo_observer.beta * uo_observer.beta);
    uo_amp_held = uo_amp;

    // 稳压角色使用目标电压计算前馈占空比，避免实际 Uo 超调后前馈增大
    // 形成正反馈维持过高输出。
    if (is_voltage_role() != 0U)
    {
        float target_amp = SQRT2_F * u_ref_active;
        dff = target_amp / fmaxf(ui_amp + target_amp, 1.0f);
    }
    else
    {
        dff = uo_amp / fmaxf(ui_amp + uo_amp, 1.0f);
    }
    dff = clampf_local(dff, PWM_D_MIN, PWM_D_MAX);
    dff_target = dff;

    ctrl_active = ((gate_state == GATE_ACTIVE) &&
                   (run_state == ST_VOLT_RAMP ||
                    (run_state == ST_SS5_RAMP) ||
                    (run_state == ST_SS5_HOLD) ||
                    (run_state == ST_SHARE_RAMP) ||
                    (run_state == ST_RUN) ||
                    (run_state == ST_STOP_RAMP))) ? 1U : 0U;

    // 稳压角色：vd 外环调节有功电流，vq 外环压制无功分量，同时加入 Co 电流前馈。
    if (is_voltage_role() != 0U)
    {
        float v_alpha = uo_observer.alpha;
        float v_beta  = uo_observer.beta;
        float vd = v_alpha * sn - v_beta * cs;
        float vq = v_alpha * cs + v_beta * sn;
        float id_corr;
        float iq_corr;
        float duo_ref;
        float target_u;

        target_u = SQRT2_F * u_ref_active;
        id_corr = pi_update_dt(&pi_vd, target_u - vd, ctrl_active, 0.001f);
        iq_corr = pi_update_dt(&pi_vq, -vq, ctrl_active, 0.001f);
        debug_uo_d = vd;
        debug_uo_q = vq;
        debug_vd_error = target_u - vd;
        debug_vq_error = -vq;
        duo_ref = -target_u * pll_ui.omega * cs;
        iconv_ref = io_ff + CO_FARAD * duo_ref -
                    (id_corr * sn + iq_corr * cs);
    }
    // 分流角色：Unit1 测量总电流和本机电流，在 Uo PLL dq 坐标系下调节 Io。
    else if (is_share_role() != 0U)
    {
        float so = pll_uo.sin_theta;
        float co = pll_uo.cos_theta;
        float it_rms = it_fund_rms;
        float kmin_safe;
        float kmax_safe;
        float alpha;
        float target_d;
        float target_q;
        float corr_d;
        float corr_q;
        float io2_d;
        float io2_q;
        float io2_rms;
        float k_meas;

        kmin_safe = fmaxf(0.5f, it_rms / I_BRANCH_CMD_MAX - 1.0f);
        if (it_rms > I_BRANCH_CMD_MAX)
            kmax_safe = fminf(2.0f, I_BRANCH_CMD_MAX /
                              fmaxf(it_rms - I_BRANCH_CMD_MAX, 0.01f));
        else
            kmax_safe = 2.0f;

        if (kmin_safe > kmax_safe)
        {
            stop_request = 1U;
            k_limited = 1U;
            k_active = 1.0f;
        }
        else
        {
            float requested = clampf_local(k_cmd, kmin_safe, kmax_safe);
            k_limited = (fabsf(requested - k_cmd) > 0.001f) ? 1U : 0U;
            k_active = slew(k_active, requested, 0.5f * 0.001f);
        }

        alpha = (k_active / (1.0f + k_active)) * share_alpha_ramp;
        target_d = alpha * it_dq.d;
        target_q = alpha * it_dq.q;
        corr_d = pi_update_dt(&pi_sd, target_d - io_dq.d, ctrl_active, 0.001f);
        corr_q = pi_update_dt(&pi_sq, target_q - io_dq.q, ctrl_active, 0.001f);
        iconv_ref = target_d * so + target_q * co +
                    CO_FARAD * uo_observer.dalpha +
                    corr_d * so + corr_q * co;

        io2_d = it_dq.d - io_dq.d;
        io2_q = it_dq.q - io_dq.q;
        io2_rms = sqrtf(io2_d * io2_d + io2_q * io2_q) * INV_SQRT2_F;
        k_meas = io_fund_rms / fmaxf(io2_rms, 0.02f);
        share_error_pct = 100.0f * fabsf(k_active - k_meas) /
                            fmaxf(k_active, 0.01f);
    }
    else
    {
        pi_reset(&pi_vd); pi_reset(&pi_vq);
        pi_reset(&pi_sd); pi_reset(&pi_sq);
    }

    iconv_ref = clampf_local(iconv_ref, -SQRT2_F * I_BRANCH_CMD_MAX,
                             SQRT2_F * I_BRANCH_CMD_MAX);
    iconv_ref_target = iconv_ref;
}

// 内环：电感电流 PI — 20 kHz 快速路径。
//********** 电流内环 (20kHz) **********//
void control_update_fast(void)
{
    // 20 kHz 快速路径：将保持的 iconv_ref 映射为电感电流参考，经斜率限制后
    // 通过电流内环 PI 生成占空比，同时处理过零换向和门极启动。
    // 不使用 sinf/cosf/sqrtf；dff 和 iconv_ref 来自 1 kHz 慢速路径。
    /*
     * 将1 kHz外环输出平滑插值到20 kHz，
     * 避免每1 ms出现一次明显阶跃。
     */
    dff_held = slew(dff_held, dff_target, 0.0015f);
    iconv_ref_held = slew(iconv_ref_held, iconv_ref_target, 0.006f);

    float il_ref_target;
    float il_ref_dot;
    float error;
    float v_pi;
    float denom;
    float qsign;
    float d_unsat;
    float dff = dff_held;
    float iconv_ref = iconv_ref_held;
    Uint16 ctrl_active;

    io_ff = IO_FF_A * io_ff + (1.0f - IO_FF_A) * meas.io;

    ctrl_active = ((gate_state == GATE_ACTIVE) &&
                   (run_state == ST_VOLT_RAMP ||
                    (run_state == ST_SS5_RAMP) ||
                    (run_state == ST_SS5_HOLD) ||
                    (run_state == ST_SHARE_RAMP) ||
                    (run_state == ST_RUN) ||
                    (run_state == ST_STOP_RAMP))) ? 1U : 0U;

    {
        float div = 1.0f - dff;
        if (div < 0.15f) div = 0.15f;
        il_ref_target = IL_TO_OUTPUT_SIGN * iconv_ref / div;
    }
    il_ref_target = clampf_local(il_ref_target, -IL_REF_PK_MAX,
                                 IL_REF_PK_MAX);
    il_ref = slew(il_ref_prev, il_ref_target, 0.125f);
    il_ref_dot = (il_ref - il_ref_prev) / CONTROL_TS;
    il_ref_prev = il_ref;
    il_ref = il_ref;

    if (ctrl_active != 0U)
    {
        error = il_ref - meas.il;
        v_pi = CURRENT_KP * error + pi_id.integral;
        denom = fabsf(meas.ui) + fabsf(meas.uo);
        if (denom < 10.0f) denom = 10.0f;
        qsign = (half == HALF_POS) ? 1.0f : -1.0f;
        d_unsat = dff + qsign * (L_HENRY * il_ref_dot + v_pi) / denom;
        duty = clampf_local(d_unsat, PWM_D_MIN, PWM_D_MAX);

        if (((d_unsat >= PWM_D_MIN) && (d_unsat <= PWM_D_MAX)) ||
            ((d_unsat > PWM_D_MAX) && (qsign * error < 0.0f)) ||
            ((d_unsat < PWM_D_MIN) && (qsign * error > 0.0f)))
        {
            pi_id.integral += pi_id.ki * CONTROL_TS * error;
            pi_id.integral = clampf_local(pi_id.integral, -5.0f, 5.0f);
        }
    }
    else
    {
#if GATE_OPEN_LOOP_TEST
        duty = (run_state == ST_GATE_TEST) ? OPEN_LOOP_DUTY : dff;
#else
        duty = dff;
#endif
        pi_reset(&pi_id);
    }

    // ---- 半周换向：带迟滞的过零检测 ----
    // 只有信号明确穿过±0.3V区域后，才认定完成一次换向。
    // 最小换向间隔 8ms (160 采样 @20kHz)，防止噪声导致频繁误换向。
    {
        float alpha_now = pll_ui.sogi.alpha;
        Uint16 crossed_positive = 0U;
        Uint16 crossed_negative = 0U;

