lululu-913/F280049_ACAC_Unit1/converter1.c
        if (half_change_block_count > 0U) half_change_block_count--;

        if (alpha_now > ZC_ALPHA_HYST_V)
        {
            if (zc_alpha_region == -1) crossed_positive = 1U;
            zc_alpha_region = 1;
        }
        else if (alpha_now < -ZC_ALPHA_HYST_V)
        {
            if (zc_alpha_region == 1) crossed_negative = 1U;
            zc_alpha_region = -1;
        }

        if ((gate_state == GATE_ACTIVE) && (pll_ui.locked != 0U) &&
            ((crossed_positive != 0U) || (crossed_negative != 0U)))
        {
            if (half_change_block_count == 0U)
            {
                if (crossed_positive != 0U)
                {
                    debug_half_change_count++;
                    request_half_change(HALF_POS);
                }
                else
                {
                    debug_half_change_count++;
                    request_half_change(HALF_NEG);
                }
                half_change_block_count = ZC_BLOCK_SAMPLES;
            }
            else
            {
                debug_rejected_zc_count++;
            }
        }

        if ((gate_start_pending != 0U) && (fault_code == FAULT_OK) &&
            ((crossed_positive != 0U) || (crossed_negative != 0U)))
        {
            half = (alpha_now >= 0.0f) ? HALF_POS : HALF_NEG;
            if (is_share_role() != 0U)
            {
                next_half = half;
                pwm_set_zc_a(half);
                if (pwm_clear_ost() == 0U) return;
#if POWER_STAGE_ENABLE == 1
                gate_state = GATE_ZC_A;
#endif
            }
            else
            {
                pwm_set_normal(half, duty);
                if (pwm_clear_ost() == 0U) return;
#if POWER_STAGE_ENABLE == 1
                gate_state = GATE_ACTIVE;
#endif
            }
            gate_start_pending = 0U;
            half_change_block_count = ZC_BLOCK_SAMPLES;
        }

        ui_alpha_prev = alpha_now;
    }
}

//********** 运行状态机 **********//
// SAFE→PLL→软启动→电压/分流爬升→RUN；任意故障进入 FAULT 并保持 OST。
Uint16 voltage_current_limit_1ms(void)
{
    // Io RMS 达到支路上限即进入限流；降到 92% 以下并保持 40 ms 才释放，
    // 连续 500 ms 仍不能脱离限流则锁定启动/运行故障。
    if (meas.io_rms >= I_BRANCH_CMD_MAX)
    {
        current_limit_active = 1U;
        current_release_ms = 0U;
    }
    else if (current_limit_active != 0U)
    {
        if (meas.io_rms <= 0.92f * I_BRANCH_CMD_MAX)
        {
            if (current_release_ms < 40U) current_release_ms++;
            if (current_release_ms >= 40U)
            {
                current_limit_active = 0U;
                current_limit_ms = 0U;
            }
        }
        else
        {
            current_release_ms = 0U;
        }
    }

    if (current_limit_active != 0U)
    {
        if (current_limit_ms < 501U) current_limit_ms++;
        if (current_limit_ms >= 500U) latch_fault(FAULT_START);
    }
    else
    {
        current_limit_ms = 0U;
    }
    return current_limit_active;
}

void slow_state_machine_1ms(void)
{
    float target;
    state_ms++;

    // 故障态优先级最高：持续 OST，只有人工清除请求且安全条件连续满足才回 SAFE。
    if (fault_code != FAULT_OK)
    {
        run_state = ST_FAULT;
        pwm_force_off();           // 确保所有门极驱动信号为低
        if ((clear_request != 0U) && fault_clear_conditions())
        {
            fault_code = FAULT_OK;
            warning_code = FAULT_OK;
            clear_request = 0U;
            fault_clear_safe_ms = 0U;
            run_state = ST_SAFE;       // 初始化完成，进入安全待机
            model_cmd = MODEL_SAFE;
            model_active = MODEL_SAFE;
            state_ms = 0UL;
        }
        return;
    }

    if ((stop_request != 0U) && (run_state != ST_SAFE) &&
        (run_state != ST_STOP_RAMP) && (run_state != ST_DISCHARGE) &&
        (run_state != ST_WAIT_MASTER_OFF) && (run_state != ST_GATE_TEST))
    {
        run_state = ST_STOP_RAMP;
        state_ms = 0UL;
    }

#if POWER_STAGE_ENABLE == 0
    // First build is instrumentation-only.  Model selection remains visible,
    // but a start gesture cannot leave SAFE and cannot clear the OST latch.
    pwm_force_off();           // 确保所有门极驱动信号为低
    run_state = ST_SAFE;       // 初始化完成，进入安全待机
    model_active = MODEL_SAFE;
    start_request = 0U;
    stop_request = 0U;
    state_ms = 0UL;
    return;
#endif

    switch (run_state)
    {
        case ST_SAFE:
            // SAFE：门极关闭、参考值清零；按键选择的模式只有在这里才锁存为活动模式。
            pwm_force_off();           // 确保所有门极驱动信号为低
            model_active = MODEL_SAFE;
            u_ref_active = 0.0f;
            share_alpha_ramp = 0.0f;
            bus_valid = 0U;
            ss5_stable_ms = 0U;
            voltage_stable_ms = 0U;
            voltage_error_ms = 0U;
            open_loop_test_ms = 0U;
            current_limit_ms = 0U;
            current_release_ms = 0U;
            current_limit_active = 0U;
            if (start_request != 0U)
            {
                start_request = 0U;
                if (model_is_legal(model_cmd) == 0U)
                {
                    warning_code = FAULT_MODE;
                    model_cmd = MODEL_SAFE;
                }
                else if (model_cmd != MODEL_SAFE)
                {
                    model_active = model_cmd;
                    run_state = ST_PRECHECK;
                    state_ms = 0UL;
                }
            }
            break;

        case ST_PRECHECK:
            // PRECHECK：确认输入范围和死母线，再清 PI 状态并进入输入 PLL 锁定。
            if (!dead_bus() || !input_start_ok())
            {
                if (state_ms > 2000UL) latch_fault(FAULT_START);
                break;
            }
            pi_reset(&pi_id); pi_reset(&pi_vd); pi_reset(&pi_vq);
            pi_reset(&pi_sd); pi_reset(&pi_sq);
#if GATE_OPEN_LOOP_TEST
            run_state = ST_GATE_TEST;
#else
            run_state = ST_INPUT_PLL;
#endif
            state_ms = 0UL;
            break;

        case ST_INPUT_PLL:
            // INPUT_PLL：等待输入 PLL 锁定；Unit1 分流模式等待活母线，Unit2 稳压
            // 模式先执行 5 V 软启动，单机电压模式直接进入电压爬升。
            if (pll_ui.locked != 0U)
            {
                if (is_share_role() != 0U)
                    run_state = ST_WAIT_UO;
#if UNIT_ROLE == UNIT_2
                else if (model_active == MODEL_PARALLEL)
                    run_state = ST_SS5_RAMP;
#endif
                else
                {
                    pi_reset(&pi_vd);
                    pi_reset(&pi_vq);
                    pi_vd.integral = 0.20f;
                    pi_vq.integral = 0.0f;
                    run_state = ST_VOLT_RAMP;
                    state_ms = 0UL;
                }
            }
            else if (state_ms > 2000UL) latch_fault(FAULT_PLL);
            break;

        case ST_WAIT_UO:
            // WAIT_UO：分流机保持关闸，等待主机输出超过 3.5 V 才启动输出 PLL。
            if (meas.uo_rms > 3.5f)
            {
                run_state = ST_OUTPUT_PLL;
                state_ms = 0UL;
            }
            break;

