lululu-913/F280049_ACAC_Unit1/converter1.c
        case ST_OUTPUT_PLL:
            // OUTPUT_PLL：要求 Uo 在 4.0~6.5 V、49~51 Hz、锁定且与 Ui 相差约 π，
            // 连续资格通过后才允许并联接入。
            if (meas.uo_rms < 2.5f)
            {
                run_state = ST_WAIT_UO;
                state_ms = 0UL;
            }
            else if ((meas.uo_rms >= 4.0f) && (meas.uo_rms <= 6.5f) &&
                (pll_uo.omega >= TWO_PI_F * 49.0f) &&
                (pll_uo.omega <= TWO_PI_F * 51.0f) &&
                (pll_uo.locked != 0U) &&
                (fabsf(wrap_pi(pll_uo.theta - pll_ui.theta - PI_F)) <
                 (10.0f * PI_F / 180.0f)))
            {
                bus_valid = 1U;
                share_alpha_ramp = 0.0f;
                gate_start_pending = 1U;
                run_state = ST_SHARE_RAMP;
                state_ms = 0UL;
            }
            else if (state_ms > 1000UL)
            {
                if ((pll_uo.locked != 0U) &&
                    (fabsf(wrap_pi(pll_uo.theta - pll_ui.theta - PI_F)) >=
                     (10.0f * PI_F / 180.0f)))
                    latch_fault(FAULT_PHASE);
                else
                    latch_fault(FAULT_START);
            }
            break;

        case ST_SS5_RAMP:
            // SS5_RAMP：Unit2 先把参考值从 0 缓慢升到 5 V；达到约 1 V 后才申请开闸，
            // 防止零参考下直接施加不确定的占空比。
            if (voltage_current_limit_1ms() != 0U)
                u_ref_active = slew(u_ref_active, 0.0f, 0.005f);
            else
                u_ref_active = slew(u_ref_active, 5.0f, 0.025f);
            if ((u_ref_active >= 1.0f) && (gate_state == GATE_BLOCKED))
                gate_start_pending = 1U;
            if ((u_ref_active >= 4.99f) && (meas.uo_rms >= 4.5f) &&
                (meas.uo_rms <= 5.5f) && (current_limit_active == 0U))
            {
                if (ss5_stable_ms < 100U) ss5_stable_ms++;
            }
            else ss5_stable_ms = 0U;
            if (ss5_stable_ms >= 100U)
            {
                run_state = ST_SS5_HOLD;
                state_ms = 0UL;
                ss5_stable_ms = 0U;
            }
            else if (state_ms > 1500UL) latch_fault(FAULT_START);
            break;

        case ST_SS5_HOLD:
            // SS5_HOLD：5 V 实际输出需连续稳定 500 ms，确认主机已经建立可接入母线。
            if (voltage_current_limit_1ms() != 0U)
                u_ref_active = slew(u_ref_active, 0.0f, 0.005f);
            else
                u_ref_active = slew(u_ref_active, 5.0f, 0.005f);
            if ((meas.uo_rms >= 4.5f) && (meas.uo_rms <= 5.5f) &&
                (current_limit_active == 0U))
            {
                if (ss5_stable_ms < 500U) ss5_stable_ms++;
            }
            else ss5_stable_ms = 0U;
            if (ss5_stable_ms >= 500U)
            {
                pi_reset(&pi_vd);
                pi_reset(&pi_vq);
                pi_vd.integral = 0.20f;
                pi_vq.integral = 0.0f;
                run_state = ST_VOLT_RAMP;
                state_ms = 0UL;
                voltage_stable_ms = 0U;
            }
            else if (state_ms > 1500UL) latch_fault(FAULT_START);
            break;

        case ST_VOLT_RAMP:
            // VOLT_RAMP：从 1 V 起按约 1 s 斜坡到目标值；低端/高端微调也在此阶段生效。
            target = effective_u_ref();
            if (voltage_current_limit_1ms() != 0U)
            {
                u_ref_active = slew(u_ref_active, 0.0f, 0.005f);
            }
            else
            {
                float ramp_target = ((target < 1.0f) &&
                                     (gate_state == GATE_BLOCKED)) ? 1.0f : target;
#if UNIT_ROLE == UNIT_2
                float ramp_span = (model_active == MODEL_PARALLEL) ?
                                  fmaxf(target - 5.0f, 1.0f) : fmaxf(target, 1.0f);
#else
                float ramp_span = fmaxf(target, 1.0f);
#endif
                u_ref_active = slew(u_ref_active, ramp_target,
                                      ramp_span / 500.0f);
            }
            if ((u_ref_active >= 1.0f) && (gate_state == GATE_BLOCKED))
                gate_start_pending = 1U;
            if ((fabsf(u_ref_active - target) < 0.01f) &&
                (fabsf(meas.uo_rms - target) <=
                 fmaxf(0.5f, 0.02f * target)))
            {
                if (voltage_stable_ms < 100U) voltage_stable_ms++;
            }
            else voltage_stable_ms = 0U;
            if ((state_ms >= 1000UL) && (voltage_stable_ms >= 100U))
            {
                run_state = ST_RUN;
                state_ms = 0UL;
                voltage_error_ms = 0U;
            }
            else if (state_ms > 2000UL) latch_fault(FAULT_START);
            break;

        case ST_SHARE_RAMP:
            // SHARE_RAMP：并联机逐步增加分流权重 alpha，避免一次性抢占主机电流。
            share_alpha_ramp = slew(share_alpha_ramp, 1.0f, 0.005f);
            if (share_alpha_ramp >= 0.999f)
            {
                run_state = ST_RUN;
                state_ms = 0UL;
            }
            break;

        case ST_RUN:
            // RUN：持续监测输入、PLL、输出误差和支路电流；稳压角色执行电流优先降压。
            if (is_voltage_role())
            {
                target = effective_u_ref();
                if (voltage_current_limit_1ms() != 0U)
                    u_ref_active = slew(u_ref_active, 0.0f, 0.005f);
                else
                    u_ref_active = slew(u_ref_active, target, 0.005f);

                if (fabsf(meas.uo_rms - u_ref_active) >
                    fmaxf(0.5f, 0.05f * u_ref_active))
                {
                    if (voltage_error_ms < 1000U) voltage_error_ms++;
                    if (voltage_error_ms >= 1000U) latch_fault(FAULT_START);
                }
                else voltage_error_ms = 0U;
            }
            break;

        case ST_STOP_RAMP:
            // STOP_RAMP：先撤销分流或降低电压参考，电流降到安全值后再回到等待/放电。
            if (is_share_role())
            {
                share_alpha_ramp = slew(share_alpha_ramp, 0.0f, 0.005f);
                if (share_alpha_ramp <= 0.001f)
                {
                    pwm_force_off();           // 确保所有门极驱动信号为低
                    run_state = ST_WAIT_MASTER_OFF;
                    state_ms = 0UL;
                }
            }
            else
            {
                u_ref_active = slew(u_ref_active, 0.0f, 0.005f);
                if ((u_ref_active < 1.0f) &&
                    (meas.il_rms < 0.10f) && (meas.io_rms < 0.10f))
                {
                    pwm_force_off();           // 确保所有门极驱动信号为低
                    run_state = ST_DISCHARGE;
                    state_ms = 0UL;
                }
            }
            break;

        case ST_WAIT_MASTER_OFF:
            if (dead_bus())
            {
                run_state = ST_SAFE;       // 初始化完成，进入安全待机
                model_cmd = MODEL_SAFE;
                stop_request = 0U;
                state_ms = 0UL;
            }
            break;

        case ST_DISCHARGE:
            if (dead_bus())
            {
                run_state = ST_SAFE;       // 初始化完成，进入安全待机
                model_cmd = MODEL_SAFE;
                stop_request = 0U;
                state_ms = 0UL;
            }
            else if (state_ms > 3000UL) latch_fault(FAULT_DISCHARGE);
            break;

        case ST_GATE_TEST:
#if GATE_OPEN_LOOP_TEST
            // 开环门极波形测试：固定 10% 占空比，仅做半周换向，不运行电压/电流控制环。
            // CMPSS、ADC 异常、ADCINT 溢出、KEY4 停机、OST 保护全部保留。
            ui_alpha_prev = pll_ui.sogi.alpha;
            if (gate_state == GATE_BLOCKED)
            {
                gate_start_pending = 1U;
            }
            // KEY4 短按立即停机
            if (stop_request != 0U)
            {
                stop_request = 0U;
                pwm_force_off();
                run_state = ST_SAFE;
                model_cmd = MODEL_SAFE;
                state_ms = 0UL;
                open_loop_test_ms = 0U;
                break;
            }
            // 5 秒自动关断
            if (open_loop_test_ms < 5000U) open_loop_test_ms++;
            if (open_loop_test_ms >= 5000U)
            {
                pwm_force_off();
                run_state = ST_SAFE;
                model_cmd = MODEL_SAFE;
                state_ms = 0UL;
                open_loop_test_ms = 0U;
            }
            // 不要求 Uo 建立，不触发 FAULT_START
#else
            latch_fault(FAULT_CPU);
#endif
            break;

        default:
            latch_fault(FAULT_CPU);
            break;
    }
}

