lululu-913/F280049_ACAC_Unit1/converter1.c
void keys_update_5ms(void)
{
    // 每 5 ms 扫描一次按键；先做 6 次采样消抖，再生成按下、释放和长按重复事件。
    const Uint16 raw[6] = {KEY1_IN, KEY2_IN, KEY3_IN,
                           KEY4_IN, KEY5_IN, KEY6_IN};
    Uint16 i;
    for (i = 0U; i < 6U; i++)
    {
        KeyState *k = &keys_state[i];
        Uint16 long_event = 0U;
        k->press_edge = 0U;
        k->release_edge = 0U;
        k->repeat_edge = 0U;

        if (raw[i] == k->stable)
        {
            k->count = 0U;
        }
        else if (++k->count >= 5U)
        {
            k->stable = raw[i];
            k->count = 0U;
            if (k->stable != 0U)
            {
                k->press_edge = 1U;
                k->held_ms = 0U;
                k->repeat_ms = 0U;
                k->long_fired = 0U;
            }
            else
            {
                k->release_edge = 1U;
            }
        }

        if (k->stable != 0U)
        {
            if (k->held_ms < 65000U) k->held_ms += 5U;
            if (k->repeat_ms < 65000U) k->repeat_ms += 5U;
            if ((i == 3U) && (run_state == ST_FAULT) &&
                (k->held_ms >= 2000U) && (k->long_fired == 0U))
            {
                long_event = 1U; k->long_fired = 1U;
            }
            else if ((i == 3U) && (run_state == ST_SAFE) &&
                     (k->held_ms >= 1000U) && (k->long_fired == 0U))
            {
                long_event = 1U; k->long_fired = 1U;
            }
            if ((i != 0U) && (i != 1U) && (i != 2U) && (i != 3U) &&
                (k->repeat_ms >= 150U))
            {
                k->repeat_ms = 0U; k->repeat_edge = 1U;
            }
            if (((i == 0U) || (i == 1U)) &&
                (model_cmd == MODEL_PARALLEL) && (k->repeat_ms >= 150U))
            {
                k->repeat_ms = 0U; k->repeat_edge = 1U;
            }
        }
        key_action(i + 1U, k->press_edge | k->repeat_edge,
                   k->release_edge, long_event);
    }
}

void key_action(Uint16 key, Uint16 repeat_event, Uint16 release_event,
                       Uint16 long_event)
{
    // 按键只修改命令值，不直接改 PWM。模式、启停和故障清除均交给 1 ms 状态机执行。
    // Unit1 的 KEY5/KEY6 在 1 V、最高电压附近复用为 ±25 mV 微调；其它位置为 0.5 V 步进。
    float hi = active_u_max();
    float direction = ((key == 1U) || (key == 5U)) ? -1.0f : 1.0f;

    if ((key == 3U) && (release_event != 0U) && (run_state == ST_SAFE))
    {
#if UNIT_ROLE == UNIT_1
        if (model_cmd == MODEL_SAFE) model_cmd = MODEL_VOLTAGE;
        else if (model_cmd == MODEL_VOLTAGE) model_cmd = MODEL_PARALLEL;
        else model_cmd = MODEL_SAFE;
#else
        model_cmd = (model_cmd == MODEL_SAFE) ? MODEL_PARALLEL : MODEL_SAFE;
#endif
        warning_code = FAULT_OK;
        return;
    }

    if (key == 4U)
    {
        if (long_event != 0U)
        {
            if (run_state == ST_SAFE) start_request = 1U;
            else if (run_state == ST_FAULT) clear_request = 1U;
        }
        else if ((release_event != 0U) && (keys_state[3].long_fired == 0U) &&
                 (run_state != ST_SAFE) && (run_state != ST_FAULT))
        {
            stop_request = 1U;
        }
        return;
    }

    if (run_state == ST_FAULT) return;
#if DIRECTION_DIAG_8V
    return;
#endif

#if UNIT_ROLE == UNIT_1
    if (((key == 1U) || (key == 2U)) &&
        (model_cmd == MODEL_PARALLEL) && (repeat_event != 0U))
    {
        k_cmd = clampf_local(k_cmd + direction * 0.05f, 0.5f, 2.0f);
        return;
    }
    if (((key == 1U) || (key == 2U)) &&
        (model_cmd == MODEL_VOLTAGE) && (release_event != 0U))
    {
        if (fabsf(u_ref_cmd - 1.0f) < 0.001f)
            trim_low = clampf_local(trim_low + direction * 0.025f,
                                      -0.100f, 0.100f);
        else if (fabsf(u_ref_cmd - hi) < 0.001f)
            trim_high = clampf_local(trim_high + direction * 0.025f,
                                       -0.100f, 0.100f);
        return;
    }
#endif

    if (((key == 5U) || (key == 6U)) && (repeat_event != 0U))
    {
        float lo = ((UNIT_ROLE == UNIT_2) ||
                    (model_cmd == MODEL_PARALLEL)) ? 5.0f : 1.0f;
        // KEY5 decrements and KEY6 increments on this hardware assignment.
        u_ref_cmd = clampf_local(u_ref_cmd + direction * 0.5f, lo, hi);
        u_ref_cmd = floorf(u_ref_cmd * 2.0f + 0.5f) * 0.5f;
    }
}
